<!DOCTYPE HTML><html lang="zh"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><title>连续栈 - 深入理解Golang设计与实现 - 开源图书(OpenBooks)</title><meta name="description" content=""><script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon"><link rel="next" href="03.6.html"><link rel="prev" href="03.4.html"></head><body><div class="book"><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a><h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".">连续栈</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div id="book-search-results"><div class="search-noresults"><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script><section class="normal markdown-section"><h1 id="35-&#x8FDE;&#x7EED;&#x6808;">3.5 &#x8FDE;&#x7EED;&#x6808;</h1><p>Go&#x8BED;&#x8A00;&#x652F;&#x6301;goroutine&#xFF0C;&#x6BCF;&#x4E2A;goroutine&#x9700;&#x8981;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6808;&#x3002;&#x5047;&#x5982;&#x6BCF;&#x4E2A;goroutine&#x5206;&#x914D;&#x56FA;&#x5B9A;&#x6808;&#x5927;&#x5C0F;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x589E;&#x957F;&#xFF0C;&#x592A;&#x5C0F;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x6EA2;&#x51FA;&#xFF0C;&#x592A;&#x5927;&#x53C8;&#x4F1A;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#xFF0C;&#x65E0;&#x6CD5;&#x5B58;&#x5728;&#x8BB8;&#x591A;&#x7684;goroutine&#x3002;</p><p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;goroutine&#x53EF;&#x4EE5;&#x521D;&#x59CB;&#x65F6;&#x53EA;&#x7ED9;&#x6808;&#x5206;&#x914D;&#x5F88;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x968F;&#x7740;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x5730;&#x589E;&#x957F;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;Go&#x53EF;&#x4EE5;&#x5F00;&#x5343;&#x5343;&#x4E07;&#x4E07;&#x4E2A;goroutine&#x800C;&#x4E0D;&#x4F1A;&#x8017;&#x5C3D;&#x5185;&#x5B58;&#x3002;</p><p>Go1.3&#x7248;&#x672C;&#x4E4B;&#x540E;&#x5219;&#x4F7F;&#x7528;&#x7684;&#x662F;continuous stack&#xFF0C;&#x4E0B;&#x9762;&#x5C06;&#x5177;&#x4F53;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x3002;</p><h2 id="&#x57FA;&#x672C;&#x539F;&#x7406;">&#x57FA;&#x672C;&#x539F;&#x7406;</h2><p>&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;Go&#x7684;runtime&#x90FD;&#x4F1A;&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#xFF0C;&#x82E5;&#x5F53;&#x524D;&#x6808;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x591F;&#x7528;&#xFF0C;&#x5219;&#x4F1A;&#x89E6;&#x53D1;&#x201C;&#x4E2D;&#x65AD;&#x201D;&#xFF0C;&#x4ECE;&#x5F53;&#x524D;&#x51FD;&#x6570;&#x8FDB;&#x5165;&#x5230;Go&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x5E93;&#xFF0C;Go&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x5E93;&#x4F1A;&#x4FDD;&#x5B58;&#x6B64;&#x65F6;&#x7684;&#x51FD;&#x6570;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#xFF0C;&#x5C06;&#x65E7;&#x6808;&#x7684;&#x5185;&#x5BB9;&#x62F7;&#x8D1D;&#x5230;&#x65B0;&#x6808;&#x4E2D;&#xFF0C;&#x5E76;&#x505A;&#x4E00;&#x4E9B;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F7F;&#x5F97;&#x5F53;&#x51FD;&#x6570;&#x6062;&#x590D;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x4F1A;&#x5728;&#x65B0;&#x5206;&#x914D;&#x7684;&#x6808;&#x4E2D;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x4EFF;&#x4F5B;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x90FD;&#x6CA1;&#x53D1;&#x751F;&#x8FC7;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x5757;&#x5927;&#x5C0F;&#x201C;&#x65E0;&#x9650;&#x201D;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x3002;</p><h2 id="&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;">&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;</h2><p>&#x5728;&#x7814;&#x7A76;Go&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4E4B;&#x524D;&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x81EA;&#x5DF1;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x80AF;&#x5B9A;&#x8981;&#x6709;&#x67D0;&#x79CD;&#x673A;&#x5236;&#x68C0;&#x6D4B;&#x5230;&#x5F53;&#x524D;&#x6808;&#x5927;&#x5C0F;&#x4E0D;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E94;&#x8BE5;&#x662F;&#x628A;&#x5F53;&#x524D;&#x7684;&#x6808;&#x5BC4;&#x5B58;&#x5668;SP&#x8DDF;&#x6808;&#x7684;&#x53EF;&#x7528;&#x6808;&#x7A7A;&#x95F4;&#x7684;&#x8FB9;&#x754C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x80FD;&#x591F;&#x68C0;&#x6D4B;&#x5230;&#x6808;&#x5927;&#x5C0F;&#x4E0D;&#x591F;&#x7528;&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x6355;&#x6349;&#x5230;&#x4E86;&#x201C;&#x4E2D;&#x65AD;&#x201D;&#x3002;</p><p>&#x6355;&#x83B7;&#x5B8C;&#x201C;&#x4E2D;&#x65AD;&#x201D;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B65;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x662F;&#x8FDB;&#x5165;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x4FDD;&#x5B58;&#x5F53;&#x524D;goroutine&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x522B;&#x9677;&#x5165;&#x5982;&#x4F55;&#x4FDD;&#x5B58;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5148;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x628A;&#x51FD;&#x6570;&#x6808;&#x589E;&#x957F;&#x65F6;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4FDD;&#x5B58;&#x597D;&#x4E86;&#xFF0C;&#x90A3;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5206;&#x914D;&#x65B0;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x60F3;&#x8C61;&#x6210;&#x5C31;&#x662F;&#x8C03;&#x7528;&#x4E00;&#x4E0B;malloc&#x800C;&#x5DF2;&#x3002;</p><p>&#x63A5;&#x4E0B;&#x6765;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x8981;&#x5C06;&#x65E7;&#x6808;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x62F7;&#x8D1D;&#x5230;&#x65B0;&#x6808;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x51FD;&#x6570;&#x7EE7;&#x7EED;&#x5728;&#x65B0;&#x6808;&#x4E2D;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x91CC;&#x5148;&#x6682;&#x65F6;&#x5FFD;&#x7565;&#x65E7;&#x6808;&#x5185;&#x5BB9;&#x62F7;&#x8D1D;&#x5230;&#x65B0;&#x6808;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x96BE;&#x70B9;&#xFF0C;&#x5047;&#x8BBE;&#x5728;&#x65B0;&#x6808;&#x7A7A;&#x95F4;&#x4E2D;&#x6062;&#x590D;&#x4E86;&#x201C;&#x4E2D;&#x65AD;&#x201D;&#x65F6;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x4ECE;&#x8FD0;&#x884C;&#x65F6;&#x8FD4;&#x56DE;&#x5230;&#x51FD;&#x6570;&#x3002;</p><p>&#x51FD;&#x6570;&#x5728;&#x65B0;&#x7684;&#x6808;&#x4E2D;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x51FD;&#x6570;&#x5982;&#x4F55;&#x8FD4;&#x56DE;&#x3002;&#x56E0;&#x4E3A;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x540E;&#x6808;&#x662F;&#x8981;&#x7F29;&#x5C0F;&#x7684;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4F1A;&#x5185;&#x5B58;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x9700;&#x8981;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x5904;&#x7406;&#x6808;&#x7F29;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#x3002;</p><h2 id="&#x5177;&#x4F53;&#x7EC6;&#x8282;">&#x5177;&#x4F53;&#x7EC6;&#x8282;</h2><h3 id="&#x5982;&#x4F55;&#x6355;&#x83B7;&#x5230;&#x51FD;&#x6570;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;">&#x5982;&#x4F55;&#x6355;&#x83B7;&#x5230;&#x51FD;&#x6570;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;</h3><p>Go&#x8BED;&#x8A00;&#x548C;C&#x4E0D;&#x540C;&#xFF0C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x6808;&#x6307;&#x9488;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x6808;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x786E;&#x5B9A;&#x51FD;&#x6570;&#x7684;&#x6808;&#x7684;&#x3002;&#x5728;Go&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x5E93;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;goroutine&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;G&#xFF0C;&#x5927;&#x81F4;&#x76F8;&#x5F53;&#x4E8E;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x5B58;&#x4E86;stackbase&#x548C;stackguard&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x4E2A;goroutine&#x4F7F;&#x7528;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x4FE1;&#x606F;&#x3002;&#x6BCF;&#x4E2A;Go&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x524D;&#x51E0;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x5148;&#x6BD4;&#x8F83;&#x6808;&#x6307;&#x9488;&#x5BC4;&#x5B58;&#x5668;&#x8DDF;g-&gt;stackguard&#xFF0C;&#x68C0;&#x6D4B;&#x662F;&#x5426;&#x53D1;&#x751F;&#x6808;&#x6EA2;&#x51FA;&#x3002;&#x5982;&#x679C;&#x6808;&#x6307;&#x9488;&#x5BC4;&#x5B58;&#x5668;&#x503C;&#x8D85;&#x8D8A;&#x4E86;stackguard&#x5C31;&#x9700;&#x8981;&#x6269;&#x5C55;&#x6808;&#x7A7A;&#x95F4;&#x3002;</p><p>&#x4E3A;&#x4E86;&#x52A0;&#x6DF1;&#x7406;&#x89E3;&#xFF0C;&#x4E0B;&#x9762;&#x8BA9;&#x6211;&#x4EEC;&#x8DDF;&#x8E2A;&#x4E00;&#x4E0B;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x770B;&#x770B;&#x5B9E;&#x9645;&#x751F;&#x6210;&#x7684;&#x6C47;&#x7F16;&#x5427;&#x3002;&#x9996;&#x5148;&#x5199;&#x4E00;&#x4E2A;test.go&#x6587;&#x4EF6;&#xFF0C;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p><pre><code>package main
func main() {
    main()
}
</code></pre><p>&#x7136;&#x540E;&#x751F;&#x6210;&#x6C47;&#x7F16;&#x6587;&#x4EF6;&#xFF1A;</p><pre><code>go tool 6g -S test.go | head -8
</code></pre><p>&#x53EF;&#x4EE5;&#x770B;&#x4EE5;&#x8F93;&#x51FA;&#x662F;&#xFF1A;</p><pre><code>000000 00000 (test.go:3)    TEXT    &quot;&quot;.main+0(SB),$0-0
000000 00000 (test.go:3)    MOVQ    (TLS),CX
0x0009 00009 (test.go:3)    CMPQ    SP,(CX)
0x000c 00012 (test.go:3)    JHI    ,21
0x000e 00014 (test.go:3)    CALL    ,runtime.morestack00_noctxt(SB)
0x0013 00019 (test.go:3)    JMP    ,0
0x0015 00021 (test.go:3)    NOP    ,
</code></pre><p>&#x8BA9;&#x6211;&#x4EEC;&#x597D;&#x597D;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x3002;(TLS)&#x53D6;&#x5230;&#x7684;&#x662F;&#x7ED3;&#x6784;&#x4F53;G&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x57DF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;g-&gt;stackguard&#x5730;&#x5740;&#xFF0C;&#x5C06;&#x5B83;&#x8D4B;&#x503C;&#x7ED9;CX&#x3002;&#x7136;&#x540E;CX&#x5730;&#x5740;&#x7684;&#x503C;&#x4E0E;SP&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x5982;&#x679C;SP&#x5927;&#x4E8E;g-&gt;stackguard&#x4E86;&#xFF0C;&#x5219;&#x4F1A;&#x8C03;&#x7528;runtime.morestack&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x51E0;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x68C0;&#x6D4B;&#x6808;&#x662F;&#x5426;&#x6EA2;&#x51FA;&#x3002;</p><p>&#x4E0D;&#x8FC7;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x51FD;&#x6570;&#x5728;&#x94FE;&#x63A5;&#x65F6;&#x90FD;&#x4F1A;&#x63D2;&#x5165;&#x8FD9;&#x79CD;&#x6307;&#x4EE4;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BFB;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;<code>#pragma textflag 7</code>&#xFF0C;&#x6216;&#x8005;&#x5728;&#x6C47;&#x7F16;&#x51FD;&#x6570;&#x4E2D;&#x770B;&#x5230;<code>TEXT reuntime.exit(SB),7,$0</code>&#xFF0C;&#x8FD9;&#x79CD;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x4E0D;&#x4F1A;&#x68C0;&#x6D4B;&#x6808;&#x6EA2;&#x51FA;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x7F16;&#x8BD1;&#x6807;&#x8BB0;&#xFF0C;&#x63A7;&#x5236;&#x662F;&#x5426;&#x751F;&#x6210;&#x6808;&#x6EA2;&#x51FA;&#x68C0;&#x6D4B;&#x6307;&#x4EE4;&#x3002;</p><p>runtime.morestack&#x662F;&#x7528;&#x6C47;&#x7F16;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5927;&#x81F4;&#x662F;&#x5C06;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x5B58;&#x5728;M&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5305;&#x62EC;&#x5F53;&#x524D;&#x6808;&#x6862;&#xFF0C;&#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x524D;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#xFF08;&#x4E24;&#x4E2A;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;runtime.morestack&#x7684;&#x51FD;&#x6570;&#x5730;&#x5740;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;f&#x7684;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#xFF09;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x628A;&#x65B0;&#x6808;&#x548C;&#x65E7;&#x6808;&#x94FE;&#x8D77;&#x6765;&#x3002;</p><pre><code>void runtime.morestack() {
    if(g == g0) {
        panic();
    } else {
        m-&gt;morebuf.gobuf_pc = getCallerCallerPC();
        void *SP = getCallerSP();
        m-&gt;morebuf.gobuf_sp = SP;
        m-&gt;moreargp = SP;
        m-&gt;morebuf.gobuf_g = g;
        m-&gt;morepc = getCallerPC();

        void *g0 = m-&gt;g0;
        g = g0;
        setSP(g0-&gt;g_sched.gobuf_sp);
        runtime.newstack();
    }
}
</code></pre><p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5C31;&#x662F;newstack&#x662F;&#x5207;&#x6362;&#x5230;m-&gt;g0&#x7684;&#x6808;&#x4E2D;&#x53BB;&#x8C03;&#x7528;&#x7684;&#x3002;m-&gt;g0&#x662F;&#x8C03;&#x5EA6;&#x5668;&#x6808;&#xFF0C;go&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x5E93;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x4F7F;&#x7528;&#x7684;&#x90FD;&#x662F;m-&gt;g0&#x3002;</p><h3 id="&#x65E7;&#x6808;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x65B0;&#x6808;">&#x65E7;&#x6808;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x65B0;&#x6808;</h3><p>runtime.morestack&#x4F1A;&#x8C03;&#x7528;&#x4E8E;runtime.newstack&#xFF0C;newstack&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF1A;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x65B0;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5C06;&#x65E7;&#x7684;&#x6808;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x65B0;&#x7684;&#x6808;&#x4E2D;&#xFF0C;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x4FEE;&#x9970;&#xFF0C;&#x4F2A;&#x88C5;&#x6210;&#x8C03;&#x7528;&#x8FC7;runtime.lessstack&#x7684;&#x6837;&#x5B50;&#xFF08;&#x8FD9;&#x6837;&#x5F53;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x5C31;&#x4F1A;&#x8C03;&#x7528;runtime.lessstack&#x518D;&#x6B21;&#x8FDB;&#x5165;runtime&#x4E2D;&#x505A;&#x4E00;&#x4E9B;&#x6808;&#x6536;&#x7F29;&#x7684;&#x5904;&#x7406;&#xFF09;&#x3002;</p><p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x96BE;&#x70B9;&#xFF1A;&#x65E7;&#x6808;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x65B0;&#x6808;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8981;&#x8003;&#x8651;&#x6307;&#x9488;&#x5931;&#x6548;&#x95EE;&#x9898;&#x3002;</p><p>&#x6BD4;&#x5982;&#x6709;&#x67D0;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x5F15;&#x7528;&#x4E86;&#x65E7;&#x6808;&#x4E2D;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x662F;&#x5C06;&#x65E7;&#x6808;&#x5185;&#x5BB9;&#x642C;&#x5230;&#x65B0;&#x6808;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x6307;&#x9488;&#x5C31;&#x5931;&#x6548;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x65E7;&#x6808;&#x5DF2;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x5E94;&#x8BE5;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x8BA9;&#x5B83;&#x6307;&#x5411;&#x65B0;&#x6808;&#x7684;&#x5BF9;&#x5E94;&#x5730;&#x5740;&#x3002;&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p><pre><code>func f1() {
    var a A
    f(&amp;a)
}
func f2(a *A) {
    // modify a
}
</code></pre><p>&#x5982;&#x679C;&#x5728;f2&#x4E2D;&#x53D1;&#x751F;&#x4E86;&#x6808;&#x589E;&#x957F;&#xFF0C;&#x6B64;&#x65F6;&#x5206;&#x914D;&#x66F4;&#x5927;&#x7684;&#x7A7A;&#x95F4;&#x4F5C;&#x4E3A;&#x65B0;&#x6808;&#xFF0C;&#x5E76;&#x5C06;&#x65E7;&#x6808;&#x5185;&#x5BB9;&#x62F7;&#x8D1D;&#x5230;&#x65B0;&#x6808;&#x4E2D;&#xFF0C;&#x4EC5;&#x4EC5;&#x8FD9;&#x6837;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;f2&#x4E2D;&#x7684;a&#x8FD8;&#x662F;&#x6307;&#x5411;&#x65E7;&#x6808;&#x4E2D;&#x7684;f1&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x8C03;&#x6574;&#x3002;</p><p>Go&#x5B9E;&#x73B0;&#x4E86;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x77E5;&#x9053;&#x6BCF;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x5BF9;&#x5E94;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x590D;&#x5236;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x8FDB;&#x884C;&#x6307;&#x9488;&#x7684;&#x8C03;&#x6574;&#x3002;&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x5BF9;&#x5F53;&#x524D;&#x6808;&#x5E27;&#x4E4B;&#x524D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#xFF0C;&#x5BF9;&#x5176;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x68C0;&#x6D4B;&#x6307;&#x9488;&#x6307;&#x5411;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x679C;&#x6307;&#x5411;&#x5730;&#x5740;&#x662F;&#x843D;&#x5728;&#x65E7;&#x6808;&#x8303;&#x56F4;&#x5185;&#x7684;&#xFF0C;&#x5219;&#x5C06;&#x5B83;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x504F;&#x79FB;&#x4F7F;&#x5B83;&#x6307;&#x5411;&#x65B0;&#x6808;&#x7684;&#x76F8;&#x5E94;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x4E2A;&#x504F;&#x79FB;&#x503C;&#x7B49;&#x4E8E;&#x65B0;&#x6808;&#x57FA;&#x5730;&#x5740;&#x51CF;&#x65E7;&#x6808;&#x57FA;&#x5730;&#x5740;&#x3002;</p><p>runtime.lessstack&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5207;&#x6362;&#x5230;m-&gt;g0&#x6808;&#x4E4B;&#x540E;&#x8C03;&#x7528;runtime.oldstack&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x65F6;&#x4E4B;&#x524D;&#x4FDD;&#x5B58;&#x7684;&#x90A3;&#x4E2A;Stktop&#x7ED3;&#x6784;&#x4F53;&#x662F;&#x65F6;&#x5019;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x4E86;&#xFF0C;&#x4ECE;&#x4E0A;&#x9762;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x65E7;&#x6808;&#x7A7A;&#x95F4;&#x7684;SP&#x548C;PC&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x8FC7;runtime.gogo&#x8DF3;&#x8F6C;&#x8FC7;&#x53BB;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p><pre><code>gp = m-&gt;curg; //&#x5F53;&#x524D;g
top = (Stktop*)gp-&gt;stackbase; //&#x53D6;&#x5F97;Stktop&#x7ED3;&#x6784;&#x4F53;
label = top-&gt;gobuf; //&#x4ECE;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x53D6;&#x51FA;Gobuf
runtime&#xB7;gogo(&amp;label, cret); //&#x901A;&#x8FC7;Gobuf&#x6062;&#x590D;&#x4E0A;&#x4E0B;&#x6587;
</code></pre><h2 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h2><ol><li>&#x4F7F;&#x7528;&#x5206;&#x6BB5;&#x6808;&#x7684;&#x51FD;&#x6570;&#x5934;&#x51E0;&#x4E2A;&#x6307;&#x4EE4;&#x68C0;&#x6D4B;SP&#x548C;stackguard&#xFF0C;&#x8C03;&#x7528;runtime.morestack</li><li>runtime.morestack&#x51FD;&#x6570;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x662F;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7684;&#x6808;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x6362;&#x6210;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x6808;&#x8C03;&#x7528;runtime.newstack</li><li>runtime.newstack&#x51FD;&#x6570;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x662F;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF0C;&#x88C5;&#x9970;&#x6B64;&#x7A7A;&#x95F4;&#xFF0C;&#x5C06;&#x65E7;&#x7684;frame&#x548C;arg&#x5F04;&#x5230;&#x65B0;&#x7A7A;&#x95F4;</li><li>&#x4F7F;&#x7528;gogocall&#x7684;&#x65B9;&#x5F0F;&#x5207;&#x6362;&#x5230;&#x65B0;&#x5206;&#x914D;&#x7684;&#x6808;&#xFF0C;gogocall&#x4F7F;&#x7528;&#x7684;JMP&#x8FD4;&#x56DE;&#x5230;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#x51FD;&#x6570;</li><li>&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x9047;&#x5230;RET&#x6307;&#x4EE4;&#x65F6;&#x4F1A;&#x8FD4;&#x56DE;&#x5230;runtime.lessstack&#xFF0C;lessstack&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8DDF;morestack&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x8981;&#x51C6;&#x5907;&#x597D;&#x4ECE;new stack&#x5230;old stack</li></ol><p>&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x6709;&#x70B9;&#x50CF;&#x4E00;&#x6B21;&#x4E2D;&#x65AD;&#xFF0C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x65F6;&#x4FDD;&#x5B58;&#x5F53;&#x65F6;&#x7684;&#x73B0;&#x573A;&#xFF0C;&#x5F04;&#x4E2A;&#x65B0;&#x7684;&#x6808;&#xFF0C;&#x4E2D;&#x65AD;&#x6062;&#x590D;&#x65F6;&#x6062;&#x590D;&#x5230;&#x65B0;&#x6808;&#x4E2D;&#x8FD0;&#x884C;&#x3002;&#x6808;&#x7684;&#x6536;&#x7F29;&#x662F;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#xFF0E;&#x5F53;&#x68C0;&#x6D4B;&#x5230;&#x6808;&#x53EA;&#x4F7F;&#x7528;&#x4E86;&#x4E0D;&#x5230;1/4&#x65F6;&#xFF0C;&#x6808;&#x7F29;&#x5C0F;&#x4E3A;&#x539F;&#x6765;&#x7684;1/2.</p><h2 id="links">links</h2><ul><li><a href="preface.md">&#x76EE;&#x5F55;</a></li><li>&#x4E0A;&#x4E00;&#x8282;: <a href="03.4.html">defer&#x5173;&#x952E;&#x5B57;</a></li><li>&#x4E0B;&#x4E00;&#x8282;: <a href="03.6.html">&#x95ED;&#x5305;&#x7684;&#x5B9E;&#x73B0;</a></li></ul></section><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div><a href="03.4.html" class="navigation navigation-prev" aria-label="上一页: defer关键字"><i class="fa fa-angle-left"></i> </a><a href="03.6.html" class="navigation navigation-next" aria-label="下一页: 闭包的实现"><i class="fa fa-angle-right"></i></a></div><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="輸入並搜尋"></div><nav role="navigation"><ul class="summary"><li class="chapter" data-level="1.1" data-path="./"><a href="./">简介</a></li><li class="chapter" data-level="1.2" data-path="01.0.html"><a href="01.0.html">如何研究Go内部实现</a><ul class="articles"><li class="chapter" data-level="1.2.1" data-path="01.1.html"><a href="01.1.html">从源代码安装Go</a></li><li class="chapter" data-level="1.2.2" data-path="01.2.html"><a href="01.2.html">本书的组织结构</a></li><li class="chapter" data-level="1.2.3" data-path="01.3.html"><a href="01.3.html">基本技巧</a></li></ul></li><li class="chapter" data-level="1.3" data-path="02.0.html"><a href="02.0.html">基本数据结构</a><ul class="articles"><li class="chapter" data-level="1.3.1" data-path="02.1.html"><a href="02.1.html">基本类型</a></li><li class="chapter" data-level="1.3.2" data-path="02.2.html"><a href="02.2.html">slice</a></li><li class="chapter" data-level="1.3.3" data-path="02.3.html"><a href="02.3.html">map的实现</a></li><li class="chapter" data-level="1.3.4" data-path="02.4.html"><a href="02.4.html">nil</a></li></ul></li><li class="chapter" data-level="1.4" data-path="03.0.html"><a href="03.0.html">函数调用协议</a><ul class="articles"><li class="chapter" data-level="1.4.1" data-path="03.1.html"><a href="03.1.html">Go调用汇编和C</a></li><li class="chapter" data-level="1.4.2" data-path="03.2.html"><a href="03.2.html">多值返回</a></li><li class="chapter" data-level="1.4.3" data-path="03.3.html"><a href="03.3.html">go关键字</a></li><li class="chapter" data-level="1.4.4" data-path="03.4.html"><a href="03.4.html">defer关键字</a></li><li class="chapter active" data-level="1.4.5" data-path="03.5.html"><a href="03.5.html">连续栈</a></li><li class="chapter" data-level="1.4.6" data-path="03.6.html"><a href="03.6.html">闭包的实现</a></li></ul></li><li class="chapter" data-level="1.5" data-path="04.0.html"><a href="04.0.html">Go语言程序初始化过程</a><ul class="articles"><li class="chapter" data-level="1.5.1" data-path="04.1.html"><a href="04.1.html">系统初始化</a></li><li class="chapter" data-level="1.5.2" data-path="04.2.html"><a href="04.2.html">main.main之前的准备</a></li></ul></li><li class="chapter" data-level="1.6" data-path="05.0.html"><a href="05.0.html">goroutine调度</a><ul class="articles"><li class="chapter" data-level="1.6.1" data-path="05.1.html"><a href="05.1.html">调度器相关数据结构</a></li><li class="chapter" data-level="1.6.2" data-path="05.2.html"><a href="05.2.html">goroutine的生老病死</a></li><li class="chapter" data-level="1.6.3" data-path="05.3.html"><a href="05.3.html">设计与演化</a></li><li class="chapter" data-level="1.6.4"><span>[死锁检测和竞态检测]</span></li><li class="chapter" data-level="1.6.5" data-path="05.5.html"><a href="05.5.html">抢占式调度</a></li></ul></li><li class="chapter" data-level="1.7" data-path="06.0.html"><a href="06.0.html">内存管理</a><ul class="articles"><li class="chapter" data-level="1.7.1" data-path="06.1.html"><a href="06.1.html">内存池</a></li><li class="chapter" data-level="1.7.2" data-path="06.2.html"><a href="06.2.html">垃圾回收上篇</a></li><li class="chapter" data-level="1.7.3" data-path="06.3.html"><a href="06.3.html">垃圾回收下篇</a></li></ul></li><li class="chapter" data-level="1.8" data-path="07.0.html"><a href="07.0.html">高级数据结构的实现</a><ul class="articles"><li class="chapter" data-level="1.8.1" data-path="07.1.html"><a href="07.1.html">channel</a></li><li class="chapter" data-level="1.8.2" data-path="07.2.html"><a href="07.2.html">interface</a></li><li class="chapter" data-level="1.8.3" data-path="07.3.html"><a href="07.3.html">方法调用</a></li></ul></li><li class="chapter" data-level="1.9" data-path="08.0.html"><a href="08.0.html">网络</a><ul class="articles"><li class="chapter" data-level="1.9.1" data-path="08.1.html"><a href="08.1.html">非阻塞io</a></li><li class="chapter" data-level="1.9.2"><span>[net包]</span></li></ul></li><li class="chapter" data-level="1.10" data-path="09.0.html"><a href="09.0.html">cgo</a><ul class="articles"><li class="chapter" data-level="1.10.1" data-path="09.1.html"><a href="09.1.html">预备知识</a></li><li class="chapter" data-level="1.10.2" data-path="09.2.html"><a href="09.2.html">cgo关键技术</a></li><li class="chapter" data-level="1.10.3" data-path="09.3.html"><a href="09.3.html">Go调用C</a></li><li class="chapter" data-level="1.10.4" data-path="09.4.html"><a href="09.4.html">C调用Go</a></li></ul></li><li class="chapter" data-level="1.11"><span>[杂项]</span><ul class="articles"><li class="chapter" data-level="1.11.1" data-path="10.1.html"><a href="10.1.html">内存模型</a></li><li class="chapter" data-level="1.11.2"><span>[pprof]</span></li><li class="chapter" data-level="1.11.3"><span>[底层同步机制]</span></li><li class="chapter" data-level="1.11.4" data-path="10.4.html"><a href="10.4.html">系统调用</a></li><li class="chapter" data-level="1.11.5"><span>[timer]</span></li><li class="chapter" data-level="1.11.6" data-path="10.7.html"><a href="10.7.html">运行时符号信息</a></li><li class="chapter" data-level="1.11.7"><span>[signal处理]</span></li></ul></li><li class="divider"></li><li><a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a></li></ul></nav></div><script>var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"连续栈","level":"1.4.5","depth":2,"next":{"title":"闭包的实现","level":"1.4.6","depth":2,"path":"03.6.md","ref":"03.6.md","articles":[]},"previous":{"title":"defer关键字","level":"1.4.4","depth":2,"path":"03.4.md","ref":"03.4.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git","minifier"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"minifier":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深入理解Golang设计与实现","language":"zh","gitbook":"*"},"file":{"path":"03.5.md","mtime":"2020-10-18T13:41:23.985Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T13:41:59.918Z"},"basePath":".","book":{"language":"zh"}});
        });</script></div><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script><script src="../gitbook/gitbook-plugin-search/search-engine.js"></script><script src="../gitbook/gitbook-plugin-search/search.js"></script><script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script><script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script><script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script><script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script><script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script><script>window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();</script></body></html>