<!DOCTYPE HTML><html lang="zh"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><title>设计与演化 - 深入理解Golang设计与实现 - 开源图书(OpenBooks)</title><meta name="description" content=""><script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon"><link rel="prev" href="05.2.html"></head><body><div class="book"><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a><h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".">设计与演化</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div id="book-search-results"><div class="search-noresults"><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script><section class="normal markdown-section"><h1 id="53-&#x8BBE;&#x8BA1;&#x4E0E;&#x6F14;&#x5316;">5.3 &#x8BBE;&#x8BA1;&#x4E0E;&#x6F14;&#x5316;</h1><p>&#x5176;&#x5B9E;&#x8BB2;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x8BB2;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x662F;&#x4E0D;&#x8DB3;&#x591F;&#x7684;&#x3002;&#x5982;&#x679C;&#x80FD;&#x8BB2;&#x6E05;&#x695A;&#x5B83;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x5219;&#x4F1A;&#x4E3E;&#x4E00;&#x53CD;&#x4E09;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x89E3;goroutine&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x8FD9;&#x91CC;&#x5C06;&#x4ECE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#x8BB2;&#x8D77;&#xFF0C;&#x8C08;&#x8C08;Go&#x8C03;&#x5EA6;&#x8BBE;&#x8BA1;&#x80CC;&#x540E;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x8BB2;&#x6E05;&#x695A;&#x5B83;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x8FD9;&#x6837;&#x5B50;&#x3002;</p><h2 id="&#x7EBF;&#x7A0B;&#x6C60;">&#x7EBF;&#x7A0B;&#x6C60;</h2><p>&#x5148;&#x770B;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x70B9;&#x7684;&#x5427;&#x3002;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x7684; &#x7EBF;&#x7A0B;&#x6C60;+&#x4EFB;&#x52A1;&#x961F;&#x5217; &#x7684;&#x6A21;&#x578B;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><p><img src="images/5.3.worker.jpg?raw=true" alt=""></p><p>&#x628A;&#x6BCF;&#x4E2A;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x53EB;worker&#x7684;&#x8BDD;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;worker&#xFF0C;&#x6BCF;&#x4E2A;worker&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x4E0D;&#x505C;&#x5730;&#x4ECE;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x4EFB;&#x52A1;&#x5E76;&#x6267;&#x884C;&#xFF1A;</p><pre><code>while(!empty(queue)) {
    q = get(queue); //&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x4E00;&#x4E2A;(&#x6D89;&#x53CA;&#x52A0;&#x9501;&#x7B49;)
    q-&gt;callback(); //&#x6267;&#x884C;&#x8BE5;&#x4EFB;&#x52A1;
}
</code></pre><p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x660E;&#x663E;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x5165;callback&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x63A7;&#x5236;&#x6743;&#x3002;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x8C03;&#x5EA6;&#x5668;&#x5C42;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5F88;&#x957F;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x4E00;&#x76F4;&#x5360;&#x7528;&#x7684;worker&#x7EBF;&#x7A0B;&#xFF0C;&#x6216;&#x8005;&#x963B;&#x585E;&#x4E8E;io&#x4E4B;&#x7C7B;&#x7684;&#x3002;</p><p>&#x4E5F;&#x8BB8;&#x7528;Go&#x8BED;&#x8A00;&#x8868;&#x8FF0;&#x4F1A;&#x66F4;&#x5730;&#x9053;&#x4E00;&#x4E9B;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x7528;Go&#x8BED;&#x8A00;&#x6765;&#x63CF;&#x8FF0;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E9B;&#x201C;&#x4EFB;&#x52A1;&#x201D;&#xFF0C;&#x4EFB;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x8981;&#x6EE1;&#x8DB3;Run&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x53EB;&#x4F5C;&#x63A5;&#x53E3;G&#x5427;&#x3002;</p><pre><code>type G interface {
    Run() 
}
</code></pre><p>&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x91CC;&#x9762;&#x5305;&#x542B;&#x5F88;&#x591A;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x7EBF;&#x7A0B;&#x6C60;&#x7684;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x4ECE;&#x5168;&#x5C40;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x663E;&#x7136;&#x662F;&#x9700;&#x8981;&#x5E76;&#x53D1;&#x4FDD;&#x62A4;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#xFF1A;</p><pre><code>type Sched struct {
    allg  []G
    lock    *sync.Mutex
}
</code></pre><p>&#x4EE5;&#x53CA;&#x5B83;&#x7684;&#x53D8;&#x91CF;</p><pre><code>var sched Sched
</code></pre><p>&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;worker&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7ED9;worker&#x6362;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;&#x5C31;&#x628A;&#x5B83;&#x53EB;M&#x5427;&#x3002;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x8BF4;&#x8FC7;&#x4E86;&#xFF0C;worker&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x4E0D;&#x505C;&#x7684;&#x53BB;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x51FA;&#x6765;&#x6267;&#x884C;&#x3002;&#x4E8E;&#x662F;&#x7528;Go&#x8BED;&#x8A00;&#x5927;&#x6982;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x8FD9;&#x6837;&#x5B50;&#xFF1A;</p><pre><code>func M() {
    for {
        sched.lock.Lock()    //&#x4E92;&#x65A5;&#x5730;&#x4ECE;&#x5C31;&#x7EEA;G&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x4E00;&#x4E2A;g&#x51FA;&#x6765;&#x8FD0;&#x884C;
        if sched.allg &gt; 0 {
            g := sched.allg[0]
            sched.allg = sched.allg[1:]
            sched.lock.Unlock()
            g.Run()        //&#x8FD0;&#x884C;&#x5B83;
        } else {
            sched.lock.Unlock()
        }
    }
}
</code></pre><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C06;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#xFF1A;</p><pre><code>for i:=0; i&lt;GOMAXPROCS; i++ {
    go M()
}
</code></pre><p>&#x5047;&#x5B9A;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;G&#x63A5;&#x53E3;&#x7684;main&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x5728;&#x81EA;&#x5DF1;&#x7684;Run&#x4E2D;&#x4E0D;&#x65AD;&#x5730;&#x5C06;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x6302;&#x5230;sched.allg&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x6C60;+&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x4E0B;&#x53BB;&#x3002;</p><p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x91CC;&#x5728;&#x4EE3;&#x7801;&#x53D6;&#x4E2D;&#x6545;&#x610F;&#x5730;&#x7528;Go&#x8BED;&#x8A00;&#x4E2D;&#x7684;G&#xFF0C;M&#xFF0C;&#x751A;&#x81F3;&#x5305;&#x62EC;GOMAXPROCS&#x7B49;&#x53D6;&#x540D;&#x5B57;&#x3002;&#x5176;&#x5B9E;&#x672C;&#x8D28;&#x4E0A;&#xFF0C;Go&#x8BED;&#x8A00;&#x7684;&#x8C03;&#x5EA6;&#x5C42;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#x7684;&#xFF1A;&#x51E0;&#x6761;&#x7269;&#x7406;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E0D;&#x505C;&#x5730;&#x53D6;goroutine&#x8FD0;&#x884C;&#x3002;</p><h2 id="&#x7CFB;&#x7EDF;&#x8C03;&#x7528;">&#x7CFB;&#x7EDF;&#x8C03;&#x7528;</h2><p>&#x4E0A;&#x9762;&#x7684;&#x60C5;&#x5F62;&#x592A;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x4E0D;&#x505C;&#x5730;&#x53D6;goroutine&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FD8;&#x4E0D;&#x80FD;&#x79F0;&#x4E4B;&#x4E3A;&#x8C03;&#x5EA6;&#x3002;&#x8C03;&#x5EA6;&#x4E4B;&#x6240;&#x4EE5;&#x4E3A;&#x8C03;&#x5EA6;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x63A7;&#x5236;&#x673A;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x54EA;&#x4E2A;goroutine&#x5E94;&#x8BE5;&#x88AB;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x8FD0;&#x884C;&#x591A;&#x4E45;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5C06;&#x5B83;&#x6362;&#x51FA;&#x6765;&#x3002;&#x7528;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x8BF4;&#x660E;Go&#x7684;&#x8C03;&#x5EA6;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5C0F;&#x95EE;&#x9898;&#x3002;Run&#x51FD;&#x6570;&#x4F1A;&#x4E00;&#x76F4;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x5B83;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x5230;&#x8C03;&#x7528;&#x5668;&#x5C42;&#x9762;&#x3002;&#x90A3;&#x4E48;&#x5047;&#x8BBE;&#x4E0A;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#x4E2D;Run&#x8FDB;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x963B;&#x585E;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;M&#x4E5F;&#x5C31;&#x8DDF;&#x7740;&#x4E00;&#x8D77;&#x963B;&#x585E;&#x4E86;&#xFF0C;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x7684;&#x7EBF;&#x7A0B;&#x5C31;&#x5C11;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;&#x65E0;&#x6CD5;&#x5145;&#x5206;&#x5229;&#x7528;CPU&#x3002;</p><p>&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#x5728;&#x8FDB;&#x5165;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E4B;&#x524D;&#x518D;&#x5236;&#x9020;&#x4E00;&#x4E2A;M&#x51FA;&#x6765;&#x5E72;&#x6D3B;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x586B;&#x8865;&#x4E86;&#x8FD9;&#x4E2A;&#x8FDB;&#x5165;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;M&#x7684;&#x7A7A;&#x7F3A;&#xFF0C;&#x59CB;&#x7EC8;&#x4FDD;&#x8BC1;&#x6709;GOMAXPROCS&#x4E2A;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x5728;&#x5E72;&#x6D3B;&#x4E86;&#x3002;</p><pre><code>func entersyscall() {
    go M()
}
</code></pre><p>&#x90A3;&#x4E48;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x65F6;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x8BA9;M&#x63A5;&#x7740;&#x5E72;&#x6D3B;&#xFF0C;&#x5C82;&#x4E0D;&#x8D85;&#x8FC7;&#x4E86;GOMAXPROCS&#x4E2A;&#x7EBF;&#x7A0B;&#x4E86;&#xFF1F;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;M&#x4E0D;&#x80FD;&#x518D;&#x5E72;&#x6D3B;&#x4E86;&#xFF0C;&#x8981;&#x9650;&#x5236;&#x5E72;&#x6D3B;&#x7684;M&#x4E2A;&#x6570;&#x4E3A;GOMAXPROCS&#x4E2A;&#xFF0C;&#x591A;&#x4E86;&#x5219;&#x8BA9;&#x5B83;&#x4EEC;&#x95F2;&#x7F6E;(&#x7269;&#x7406;&#x7EBF;&#x7A0B;&#x6BD4;CPU&#x591A;&#x5F88;&#x591A;&#x5C31;&#x6CA1;&#x610F;&#x4E49;&#x4E86;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x76F8;&#x4E92;&#x62A2;CPU&#x53CD;&#x800C;&#x4F1A;&#x964D;&#x4F4E;&#x5229;&#x7528;&#x7387;)&#x3002;</p><pre><code>func exitsyscall() {
    if len(allm) &gt;= GOMAXPROCS {
        sched.lock.Lock()
        sched.allg = append(sched.allg, g)    //&#x628A;g&#x653E;&#x56DE;&#x5230;&#x961F;&#x5217;&#x4E2D;
        sched.lock.Unlock()
        time.Sleep()    //&#x8FD9;&#x4E2A;M&#x4E0D;&#x518D;&#x5E72;&#x6D3B;
    }
}
</code></pre><p>&#x4E8E;&#x662F;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x8FD9;&#x6837;&#x5B50;:</p><p><img src="images/5.3.m_g.jpg?raw=true" alt=""></p><p>&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x4E5F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x5C31;&#x50CF;&#x7EBF;&#x7A0B;&#x6C60;&#x505A;&#x8D1F;&#x8F7D;&#x8C03;&#x8282;&#x4E00;&#x6837;&#xFF0C;&#x5F53;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x5F88;&#x957F;&#x540E;&#xFF0C;&#x5FD9;&#x4E0D;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x5219;&#x518D;&#x5F00;&#x51E0;&#x6761;&#x7EBF;&#x7A0B;&#x51FA;&#x6765;&#x3002;&#x800C;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#x4E86;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#x4E00;&#x4E9B;&#x7EBF;&#x7A0B;&#x3002;</p><h2 id="&#x534F;&#x7A0B;&#x4E0E;&#x4FDD;&#x5B58;&#x4E0A;&#x4E0B;&#x6587;">&#x534F;&#x7A0B;&#x4E0E;&#x4FDD;&#x5B58;&#x4E0A;&#x4E0B;&#x6587;</h2><p>&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x963B;&#x585E;&#x4E8E;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x4F1A;&#x767D;&#x767D;&#x6D6A;&#x8D39;CPU&#x3002;&#x800C;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x6216;&#x56DE;&#x8C03;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x53C8;&#x5341;&#x5206;&#x53CD;&#x4EBA;&#x7C7B;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x6A21;&#x578B;&#x65E2;&#x7136;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8FD9;&#x4E48;&#x7528;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x4E0A;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x770B;&#x4E0A;&#x53BB;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x786E;&#x4E0D;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x3002;</p><p>&#x5C06;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;yield&#x51FA;&#x53BB;&#xFF0C;&#x518D;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x518D;&#x5F04;&#x56DE;&#x6765;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x9EBB;&#x70E6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x3002;</p><p>&#x5728;&#x6B64;&#x5148;&#x5F15;&#x5165;&#x534F;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x534F;&#x7A0B;&#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x5B83;&#x76F8;&#x5BF9;&#x7EBF;&#x7A0B;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x5728;&#x4E8E;&#x534F;&#x7A0B;&#x975E;&#x5E38;&#x8F7B;&#x91CF;&#x7EA7;&#xFF0C;&#x8FDB;&#x884C;&#x5207;&#x6362;&#x4EE5;&#x53CA;&#x4FDD;&#x5B58;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x4EE3;&#x4EF7;&#x975E;&#x5E38;&#x7684;&#x5C0F;&#x3002;&#x534F;&#x7A0B;&#x7684;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x6709;&#x591A;&#x79CD;&#xFF0C;&#x4E0A;&#x9762;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x7EBF;&#x7A0B;&#x6C60;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x6BCF;&#x4E2A;&#x534F;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;&#x4EFB;&#x52A1;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x3002;</p><p>&#x534F;&#x7A0B;&#x4E00;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x822C;&#x4F1A;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;yield&#x7684;&#x51FD;&#x6570;&#x3002;&#x534F;&#x7A0B;&#x8FD0;&#x884C;&#x5230;&#x4E00;&#x5B9A;&#x65F6;&#x5019;&#x5C31;&#x4E3B;&#x52A8;&#x8C03;&#x7528;yield&#x653E;&#x5F03;&#x81EA;&#x5DF1;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x518D;&#x6B21;&#x653E;&#x56DE;&#x5230;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x6B21;&#x8C03;&#x7528;&#x65F6;&#x673A;&#x7B49;&#x7B49;&#x3002;</p><p>&#x5176;&#x5B9E;Go&#x8BED;&#x8A00;&#x4E2D;&#x7684;goroutine&#x5C31;&#x662F;&#x534F;&#x7A0B;&#x3002;&#x6BCF;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;G&#x4E2D;&#x6709;&#x4E00;&#x4E2A;sched&#x57DF;&#x5C31;&#x662F;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x81EA;&#x5DF1;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;goroutine&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x6362;&#x51FA;&#x53BB;&#xFF0C;&#x518D;&#x6362;&#x8FDB;&#x6765;&#x3002;&#x8FD9;&#x79CD;&#x4E0A;&#x4E0B;&#x6587;&#x4FDD;&#x5B58;&#x5728;&#x7528;&#x6237;&#x6001;&#x5B8C;&#x6210;&#xFF0C;&#x4E0D;&#x5FC5;&#x9677;&#x5165;&#x5230;&#x5185;&#x6838;&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x8F7B;&#x91CF;&#xFF0C;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#x3002;&#x4FDD;&#x5B58;&#x7684;&#x4FE1;&#x606F;&#x5F88;&#x5C11;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x524D;&#x7684;PC,SP&#x7B49;&#x5C11;&#x91CF;&#x4FE1;&#x606F;&#x3002;&#x53EA;&#x662F;&#x7531;&#x4E8E;&#x8981;&#x4F18;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x4EE3;&#x7801;&#x770B;&#x4E0A;&#x53BB;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF0C;&#x6BD4;&#x5982;&#x8981;&#x91CD;&#x7528;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x6240;&#x4EE5;&#x4F1A;&#x6709;gfree&#x548C;mhead&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x3002;</p><h2 id="go10">Go1.0</h2><p>&#x5728;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x4E0E;M&#x662F;&#x76F4;&#x63A5;&#x5BF9;&#x5E94;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E2A;&#x89E3;&#x8026;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#x3002;Go1.0&#x4E2D;&#x5C06;M&#x62BD;&#x51FA;&#x6765;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;startm&#x51FD;&#x6570;&#x662F;&#x7EBF;&#x7A0B;&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#xFF0C;&#x800C;goroutine&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#x662F;go&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&#x90A3;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x603B;&#x4F53;&#x4E0A;&#x8DDF;&#x4E0A;&#x9762;&#x7684;&#x7ED3;&#x6784;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x8FDB;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;goroutine&#x4F1A;&#x8DDF;M&#x4E00;&#x8D77;&#x8FDB;&#x5165;&#x5230;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E2D;&#xFF0C;schedule&#x4E2D;&#x4F1A;&#x5339;&#x914D;g&#x548C;m&#xFF0C;&#x8BA9;&#x7A7A;&#x95F2;&#x7684;m&#x6765;&#x8FD0;&#x884C;g&#x3002;&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230;&#x5E72;&#x6D3B;&#x7684;&#x6570;&#x91CF;&#x5C11;&#x4E8E;GOMAXPROCS&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x7740;&#x7684;m&#xFF0C;&#x5219;&#x4F1A;&#x521B;&#x5EFA;&#x65B0;&#x7684;m&#x6765;&#x8FD0;&#x884C;g&#x3002;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x6709;GOMAXPROCS&#x4E2A;m&#x5728;&#x5E72;&#x6D3B;&#x4E86;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;m&#x4F1A;&#x88AB;&#x6302;&#x8D77;&#xFF0C;&#x5B83;&#x7684;g&#x4E5F;&#x4F1A;&#x88AB;&#x6302;&#x5230;&#x5F85;&#x8FD0;&#x884C;&#x7684;goroutine&#x961F;&#x5217;&#x4E2D;&#x3002;</p><p>&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;m&#x662F;machine&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x673A;&#x5668;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5B83;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x4E86;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x6240;&#x6709;&#x7684;G&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x4E00;&#x4E2A;g&#x5F00;&#x59CB;&#x5728;&#x67D0;&#x4E2A;m&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x7ECF;&#x8FC7;&#x51E0;&#x6B21;&#x8FDB;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x5B83;&#x7684;m&#x6302;&#x8D77;&#x4E86;&#xFF0C;&#x5176;&#x5B83;&#x7684;m&#x4F1A;&#x5C06;&#x5B83;&#x4ECE;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x5E76;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;</p><p>&#x6BCF;&#x6B21;&#x8C03;&#x5EA6;&#x90FD;&#x4F1A;&#x6D89;&#x53CA;&#x5BF9;g&#x548C;m&#x7B49;&#x961F;&#x5217;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5168;&#x5C40;&#x7684;&#x6570;&#x636E;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x5C31;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x5927;&#x91CF;&#x7684;&#x9501;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x9891;&#x7E41;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E2D;&#x8FD9;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x5F00;&#x9500;&#x3002;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5F00;&#x9500;&#xFF0C;Go1.0&#x5728;&#x8FD9;&#x91CC;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#x7684;&#x3002;1.0&#x7248;&#x4E2D;&#xFF0C;&#x5728;&#x5B83;&#x7684;Sched&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;atomic&#x5B57;&#x6BB5;&#xFF0C;&#x7C7B;&#x578B;&#x662F;&#x4E00;&#x4E2A;volatile&#x7684;&#x65E0;&#x7B26;32&#x4F4D;&#x6574;&#x578B;&#x3002;</p><pre><code>// sched&#x4E2D;&#x7684;&#x539F;&#x5B50;&#x5B57;&#x6BB5;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x7684;uint32&#xFF0C;&#x5B58;&#x653E;&#x4E0B;&#x5217;&#x57DF;
// 15&#x4F4D; mcpu  --&#x6B63;&#x5728;&#x5360;&#x7528;cpu&#x8FD0;&#x884C;&#x7684;m&#x6570;&#x91CF; (&#x8FDB;&#x5165;syscall&#x7684;m&#x662F;&#x4E0D;&#x5360;&#x7528;cpu&#x7684;)
// 15&#x4F4D; mcpumax  --&#x6700;&#x5927;&#x5141;&#x8BB8;&#x8FD9;&#x4E48;&#x591A;&#x4E2A;m&#x540C;&#x65F6;&#x4F7F;&#x7528;cpu
// 1&#x4F4D;  waitstop  --&#x6709;g&#x7B49;&#x5F85;&#x7ED3;&#x675F;
// 1&#x4F4D;  gwaiting  --&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x6709;g&#x5904;&#x4E8E;waiting&#x72B6;&#x6001;
//    [15 bits] mcpu        number of m&apos;s executing on cpu
//    [15 bits] mcpumax    max number of m&apos;s allowed on cpu
//    [1 bit] waitstop    some g is waiting on stopped
//    [1 bit] gwaiting    gwait != 0
</code></pre><p>&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x662F;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x548C;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x65F6;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x5B83;&#x4F1A;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x8FDB;&#x5165;&#x5230;&#x8C03;&#x5EA6;&#x5668;&#x5C42;&#x9762;&#x3002;&#x76F4;&#x63A5;&#x7528;CAS&#x64CD;&#x4F5C;Sched&#x7684;atomic&#x5B57;&#x6BB5;&#x5224;&#x65AD;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x6253;&#x5305;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x6B21;&#x539F;&#x5B50;&#x8BFB;&#x5199;&#x83B7;&#x53D6;&#x5B83;&#x4EEC;&#x800C;&#x4E0D;&#x7528;&#x52A0;&#x9501;&#x3002;&#x8FD9;&#x5C06;&#x6781;&#x5927;&#x7684;&#x51CF;&#x5C11;&#x90A3;&#x4E9B;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x6216;&#x8005;cgo&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x7684;contention&#x3002;</p><p>&#x9664;&#x4E86;&#x8FDB;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4EE5;&#x5916;&#xFF0C;&#x64CD;&#x4F5C;&#x8FD9;&#x4E9B;&#x57DF;&#x53EA;&#x4F1A;&#x53D1;&#x751F;&#x4E8E;&#x6301;&#x6709;&#x8C03;&#x5EA6;&#x5668;&#x9501;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56E0;&#x6B64;goroutines&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5176;&#x5B83;goroutine&#x4F1A;&#x5BF9;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x8FDB;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x53EA;&#x4F1A;&#x8BFB;mcpumax&#xFF0C;waitstop&#x548C;gwaiting&#x3002;&#x51B3;&#x4E0D;&#x4F1A;&#x5199;&#x4ED6;&#x4EEC;&#x3002;&#x56E0;&#x6B64;&#xFF0C;(&#x6301;&#x6709;&#x8C03;&#x5EA6;&#x5668;&#x9501;)&#x5199;&#x8FD9;&#x4E9B;&#x57DF;&#x65F6;&#x5B8C;&#x5168;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x4F1A;&#x53D1;&#x751F;&#x5199;&#x51B2;&#x7A81;&#x3002;</p><p>&#x603B;&#x4F53;&#x4E0A;&#x770B;&#xFF0C;Go1.0&#x8C03;&#x5EA6;&#x8BBE;&#x8BA1;&#x7ED3;&#x6784;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x4EE3;&#x7801;&#x4E5F;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x3002;&#x4F46;&#x662F;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x8BBE;&#x8BA1;&#x9650;&#x5236;&#x4E86;Go&#x7A0B;&#x5E8F;&#x7684;&#x5E76;&#x53D1;&#x5EA6;&#x3002;&#x6D4B;&#x8BD5;&#x53D1;&#x73B0;&#x6709;14%&#x662F;&#x7684;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x4E86;runtime.futex()&#x4E2D;&#x3002;</p><p>&#x5177;&#x4F53;&#x5730;&#x770B;&#xFF1A;</p><ol><li>&#x5355;&#x4E2A;&#x5168;&#x5C40;&#x9501;(Sched.Lock)&#x7528;&#x6765;&#x4FDD;&#x62A4;&#x6240;&#x6709;&#x7684;goroutine&#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;(&#x521B;&#x5EFA;&#xFF0C;&#x5B8C;&#x6210;&#xFF0C;&#x8C03;&#x5EA6;&#x7B49;)&#x3002;</li><li>Goroutine&#x5207;&#x6362;&#x3002;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x5728;&#x5404;&#x81EA;&#x4E4B;&#x524D;&#x5207;&#x6362;goroutine&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x5EF6;&#x8FDF;&#x548C;&#x989D;&#x5916;&#x7684;&#x8D1F;&#x62C5;&#x3002;&#x6BCF;&#x4E2A;M&#x90FD;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x7684;G.</li><li>&#x5185;&#x5B58;&#x7F13;&#x5B58;MCache&#x662F;&#x6BCF;&#x4E2A;M&#x7684;&#x3002;&#x800C;&#x5F53;M&#x963B;&#x585E;&#x540E;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#x4E5F;&#x88AB;&#x4E00;&#x8D77;&#x62FF;&#x8D70;&#x4E86;&#x3002;</li><li>&#x8FC7;&#x591A;&#x7684;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x3001;&#x6062;&#x590D;&#x3002;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x65F6;&#x7684;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x4F1A;&#x9891;&#x7E41;&#x5730;&#x963B;&#x585E;&#xFF0C;&#x6062;&#x590D;&#xFF0C;&#x9020;&#x6210;&#x8FC7;&#x591A;&#x7684;&#x8D1F;&#x62C5;&#x3002;</li></ol><p>&#x7B2C;&#x4E00;&#x70B9;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6240;&#x6709;&#x7684;goroutine&#x90FD;&#x7528;&#x4E00;&#x4E2A;&#x9501;&#x4FDD;&#x62A4;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x9501;&#x7C92;&#x5EA6;&#x662F;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#xFF0C;&#x53EA;&#x8981;goroutine&#x7684;&#x76F8;&#x5173;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x9501;&#x4F4F;&#x8C03;&#x5EA6;&#x3002;&#x7136;&#x540E;&#x662F;goroutine&#x5207;&#x6362;&#xFF0C;&#x524D;&#x9762;&#x8BF4;&#x4E86;&#xFF0C;&#x6BCF;&#x4E2A;M&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x6240;&#x6709;&#x7684;goroutine&#x7684;&#x3002;&#x4E3E;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x6BD4;&#xFF0C;&#x591A;&#x6838;CPU&#x4E2D;&#x6BCF;&#x4E2A;&#x6838;&#x90FD;&#x53BB;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x5229;&#x4E8E;&#x7F13;&#x5B58;&#x7684;&#x5C40;&#x90E8;&#x6027;&#x7684;&#xFF0C;&#x5207;&#x6362;&#x5F00;&#x9500;&#x4E5F;&#x4F1A;&#x53D8;&#x5927;&#x3002;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x548C;&#x5176;&#x5B83;&#x7F13;&#x5B58;&#x662F;&#x5173;&#x8054;&#x5230;&#x6240;&#x6709;&#x7684;M&#x7684;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B83;&#x672C;&#x53EA;&#x9700;&#x8981;&#x5173;&#x8054;&#x5230;&#x8FD0;&#x884C;Go&#x4EE3;&#x7801;&#x7684;M(&#x963B;&#x585E;&#x4E8E;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;M&#x662F;&#x4E0D;&#x9700;&#x8981;mcache&#x7684;)&#x3002;&#x8FD0;&#x884C;&#x7740;Go&#x4EE3;&#x7801;&#x7684;M&#x548C;&#x6240;&#x6709;M&#x7684;&#x6BD4;&#x4F8B;&#x53EF;&#x80FD;&#x9AD8;&#x8FBE;1:100&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x8FC7;&#x5EA6;&#x7684;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x3002;</p><h2 id="go11">Go1.1</h2><p>Go1.1&#x76F8;&#x5BF9;&#x4E8E;1.0&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6539;&#x52A8;&#x5C31;&#x662F;&#x91CD;&#x65B0;&#x8C03;&#x7528;&#x4E86;&#x8C03;&#x5EA6;&#x5668;&#x3002;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#xFF0C;&#x8001;&#x7248;&#x672C;&#x4E2D;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x5B9E;&#x73B0;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x5F0F;&#x662F;&#x5F15;&#x5165;Processor&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x5728;Processors&#x4E4B;&#x4E0A;&#x5B9E;&#x73B0;&#x5DE5;&#x4F5C;&#x6D41;&#x7A83;&#x53D6;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x3002;</p><p>M&#x4EE3;&#x8868;OS&#x7EBF;&#x7A0B;&#x3002;P&#x4EE3;&#x8868;Go&#x4EE3;&#x7801;&#x6267;&#x884C;&#x65F6;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5F53;M&#x6267;&#x884C;Go&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5173;&#x8054;&#x4E00;&#x4E2A;P&#xFF0C;&#x5F53;M&#x4E3A;idle&#x6216;&#x8005;&#x5728;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E2D;&#x65F6;&#xFF0C;&#x5B83;&#x4E5F;&#x9700;&#x8981;P&#x3002;&#x6709;&#x521A;&#x597D;GOMAXPROCS&#x4E2A;P&#x3002;&#x6240;&#x6709;&#x7684;P&#x88AB;&#x7EC4;&#x7EC7;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5DE5;&#x4F5C;&#x6D41;&#x7A83;&#x53D6;&#x9700;&#x8981;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x3002;GOMAXPROCS&#x7684;&#x6539;&#x53D8;&#x6D89;&#x53CA;&#x5230;stop/start the world&#x6765;resize&#x6570;&#x7EC4;P&#x7684;&#x5927;&#x5C0F;&#x3002;</p><p>gfree&#x548C;grunnable&#x4ECE;sched&#x4E2D;&#x79FB;&#x5230;P&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x524D;&#x9762;&#x7684;&#x5355;&#x4E2A;&#x5168;&#x5C40;&#x9501;&#x4FDD;&#x62A4;&#x7528;&#x6709;goroutine&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7531;&#x4E8E;goroutine&#x73B0;&#x5728;&#x88AB;&#x5206;&#x5230;&#x6BCF;&#x4E2A;P&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;P&#x5C40;&#x90E8;&#x7684;goroutine&#xFF0C;&#x56E0;&#x6B64;P&#x53EA;&#x7BA1;&#x53BB;&#x64CD;&#x4F5C;&#x81EA;&#x5DF1;&#x7684;goroutine&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4E0D;&#x4F1A;&#x4E0E;&#x5176;&#x5B83;P&#x4E0A;&#x7684;goroutine&#x51B2;&#x7A81;&#x3002;&#x5168;&#x5C40;&#x7684;grunnable&#x961F;&#x5217;&#x4E5F;&#x4ECD;&#x7136;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x5728;P&#x53BB;&#x8BBF;&#x95EE;&#x5168;&#x5C40;grunnable&#x961F;&#x5217;&#x65F6;&#x624D;&#x6D89;&#x53CA;&#x5230;&#x52A0;&#x9501;&#x64CD;&#x4F5C;&#x3002;mcache&#x4ECE;M&#x4E2D;&#x79FB;&#x5230;P&#x4E2D;&#x3002;&#x4E0D;&#x8FC7;&#x5F53;&#x524D;&#x8FD8;&#x4E0D;&#x5F7B;&#x5E95;&#xFF0C;&#x5728;M&#x4E2D;&#x8FD8;&#x662F;&#x4FDD;&#x7559;&#x7740;mcache&#x57DF;&#x7684;&#x3002;</p><p>&#x52A0;&#x5165;&#x4E86;P&#x540E;&#xFF0C;sched.atomic&#x4E5F;&#x4ECE;Sched&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x53BB;&#x6389;&#x4E86;&#x3002;</p><p>&#x5F53;&#x4E00;&#x4E2A;&#x65B0;&#x7684;G&#x521B;&#x5EFA;&#x6216;&#x8005;&#x73B0;&#x6709;&#x7684;G&#x53D8;&#x6210;runnable&#xFF0C;&#x5B83;&#x5C06;&#x4E00;&#x4E2A;runnable&#x7684;goroutine&#x63A8;&#x5230;&#x5F53;&#x524D;&#x7684;P&#x3002;&#x5F53;P&#x5B8C;&#x6210;&#x6267;&#x884C;G&#xFF0C;&#x5B83;&#x5C06;G&#x4ECE;&#x81EA;&#x5DF1;&#x7684;runnable goroutine&#x4E2D;pop&#x51FA;&#x53BB;&#x3002;&#x5982;&#x679C;&#x94FE;&#x4E3A;&#x7A7A;&#xFF0C;P&#x4F1A;&#x968F;&#x673A;&#x4ECE;&#x5176;&#x5B83;P&#x4E2D;&#x7A83;&#x53D6;&#x4E00;&#x534A;&#x7684;&#x53EF;&#x8FD0;&#x884C;&#x7684;goroutine&#x3002;</p><p>&#x5F53;M&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;G&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x6709;&#x53E6;&#x4E00;&#x4E2A;M&#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;G&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;M&#x8FDB;&#x5165;&#x5230;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x6709;&#x53E6;&#x4E00;&#x4E2A;M&#x6765;&#x6267;&#x884C;G&#x7684;&#x4EE3;&#x7801;&#x3002;</p><p>2&#x5C42;&#x81EA;&#x65CB;&#xFF1A;&#x5173;&#x8054;&#x4E86;P&#x7684;&#x5904;&#x4E8E;idle&#x72B6;&#x6001;&#x7684;&#x7684;M&#x81EA;&#x65CB;&#x5BFB;&#x627E;&#x65B0;&#x7684;G&#xFF1B;&#x6CA1;&#x6709;&#x5173;&#x8054;P&#x7684;M&#x81EA;&#x65CB;&#x7B49;&#x5F85;&#x53EF;&#x7528;&#x7684;P&#x3002;&#x6700;&#x591A;&#x6709;GOMAXPROCS&#x4E2A;&#x81EA;&#x65CB;&#x7684;M&#x3002;&#x53EA;&#x8981;&#x6709;&#x7B2C;&#x4E8C;&#x7C7B;M&#x65F6;&#x7B2C;&#x4E00;&#x7C7B;M&#x5C31;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x3002;</p></section><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div><a href="05.2.html" class="navigation navigation-prev navigation-unique" aria-label="上一页: goroutine的生老病死"><i class="fa fa-angle-left"></i></a></div><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="輸入並搜尋"></div><nav role="navigation"><ul class="summary"><li class="chapter" data-level="1.1" data-path="./"><a href="./">简介</a></li><li class="chapter" data-level="1.2" data-path="01.0.html"><a href="01.0.html">如何研究Go内部实现</a><ul class="articles"><li class="chapter" data-level="1.2.1" data-path="01.1.html"><a href="01.1.html">从源代码安装Go</a></li><li class="chapter" data-level="1.2.2" data-path="01.2.html"><a href="01.2.html">本书的组织结构</a></li><li class="chapter" data-level="1.2.3" data-path="01.3.html"><a href="01.3.html">基本技巧</a></li></ul></li><li class="chapter" data-level="1.3" data-path="02.0.html"><a href="02.0.html">基本数据结构</a><ul class="articles"><li class="chapter" data-level="1.3.1" data-path="02.1.html"><a href="02.1.html">基本类型</a></li><li class="chapter" data-level="1.3.2" data-path="02.2.html"><a href="02.2.html">slice</a></li><li class="chapter" data-level="1.3.3" data-path="02.3.html"><a href="02.3.html">map的实现</a></li><li class="chapter" data-level="1.3.4" data-path="02.4.html"><a href="02.4.html">nil</a></li></ul></li><li class="chapter" data-level="1.4" data-path="03.0.html"><a href="03.0.html">函数调用协议</a><ul class="articles"><li class="chapter" data-level="1.4.1" data-path="03.1.html"><a href="03.1.html">Go调用汇编和C</a></li><li class="chapter" data-level="1.4.2" data-path="03.2.html"><a href="03.2.html">多值返回</a></li><li class="chapter" data-level="1.4.3" data-path="03.3.html"><a href="03.3.html">go关键字</a></li><li class="chapter" data-level="1.4.4" data-path="03.4.html"><a href="03.4.html">defer关键字</a></li><li class="chapter" data-level="1.4.5" data-path="03.5.html"><a href="03.5.html">连续栈</a></li><li class="chapter" data-level="1.4.6" data-path="03.6.html"><a href="03.6.html">闭包的实现</a></li></ul></li><li class="chapter" data-level="1.5" data-path="04.0.html"><a href="04.0.html">Go语言程序初始化过程</a><ul class="articles"><li class="chapter" data-level="1.5.1" data-path="04.1.html"><a href="04.1.html">系统初始化</a></li><li class="chapter" data-level="1.5.2" data-path="04.2.html"><a href="04.2.html">main.main之前的准备</a></li></ul></li><li class="chapter" data-level="1.6" data-path="05.0.html"><a href="05.0.html">goroutine调度</a><ul class="articles"><li class="chapter" data-level="1.6.1" data-path="05.1.html"><a href="05.1.html">调度器相关数据结构</a></li><li class="chapter" data-level="1.6.2" data-path="05.2.html"><a href="05.2.html">goroutine的生老病死</a></li><li class="chapter active" data-level="1.6.3" data-path="05.3.html"><a href="05.3.html">设计与演化</a></li><li class="chapter" data-level="1.6.4"><span>[死锁检测和竞态检测]</span></li><li class="chapter" data-level="1.6.5" data-path="05.5.html"><a href="05.5.html">抢占式调度</a></li></ul></li><li class="chapter" data-level="1.7" data-path="06.0.html"><a href="06.0.html">内存管理</a><ul class="articles"><li class="chapter" data-level="1.7.1" data-path="06.1.html"><a href="06.1.html">内存池</a></li><li class="chapter" data-level="1.7.2" data-path="06.2.html"><a href="06.2.html">垃圾回收上篇</a></li><li class="chapter" data-level="1.7.3" data-path="06.3.html"><a href="06.3.html">垃圾回收下篇</a></li></ul></li><li class="chapter" data-level="1.8" data-path="07.0.html"><a href="07.0.html">高级数据结构的实现</a><ul class="articles"><li class="chapter" data-level="1.8.1" data-path="07.1.html"><a href="07.1.html">channel</a></li><li class="chapter" data-level="1.8.2" data-path="07.2.html"><a href="07.2.html">interface</a></li><li class="chapter" data-level="1.8.3" data-path="07.3.html"><a href="07.3.html">方法调用</a></li></ul></li><li class="chapter" data-level="1.9" data-path="08.0.html"><a href="08.0.html">网络</a><ul class="articles"><li class="chapter" data-level="1.9.1" data-path="08.1.html"><a href="08.1.html">非阻塞io</a></li><li class="chapter" data-level="1.9.2"><span>[net包]</span></li></ul></li><li class="chapter" data-level="1.10" data-path="09.0.html"><a href="09.0.html">cgo</a><ul class="articles"><li class="chapter" data-level="1.10.1" data-path="09.1.html"><a href="09.1.html">预备知识</a></li><li class="chapter" data-level="1.10.2" data-path="09.2.html"><a href="09.2.html">cgo关键技术</a></li><li class="chapter" data-level="1.10.3" data-path="09.3.html"><a href="09.3.html">Go调用C</a></li><li class="chapter" data-level="1.10.4" data-path="09.4.html"><a href="09.4.html">C调用Go</a></li></ul></li><li class="chapter" data-level="1.11"><span>[杂项]</span><ul class="articles"><li class="chapter" data-level="1.11.1" data-path="10.1.html"><a href="10.1.html">内存模型</a></li><li class="chapter" data-level="1.11.2"><span>[pprof]</span></li><li class="chapter" data-level="1.11.3"><span>[底层同步机制]</span></li><li class="chapter" data-level="1.11.4" data-path="10.4.html"><a href="10.4.html">系统调用</a></li><li class="chapter" data-level="1.11.5"><span>[timer]</span></li><li class="chapter" data-level="1.11.6" data-path="10.7.html"><a href="10.7.html">运行时符号信息</a></li><li class="chapter" data-level="1.11.7"><span>[signal处理]</span></li></ul></li><li class="divider"></li><li><a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a></li></ul></nav></div><script>var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"设计与演化","level":"1.6.3","depth":2,"next":{"title":"[死锁检测和竞态检测]","level":"1.6.4","depth":2,"ref":"","articles":[]},"previous":{"title":"goroutine的生老病死","level":"1.6.2","depth":2,"path":"05.2.md","ref":"05.2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git","minifier"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"minifier":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深入理解Golang设计与实现","language":"zh","gitbook":"*"},"file":{"path":"05.3.md","mtime":"2020-10-18T13:41:23.985Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T13:41:59.918Z"},"basePath":".","book":{"language":"zh"}});
        });</script></div><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script><script src="../gitbook/gitbook-plugin-search/search-engine.js"></script><script src="../gitbook/gitbook-plugin-search/search.js"></script><script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script><script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script><script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script><script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script><script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script><script>window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();</script></body></html>