<!DOCTYPE HTML><html lang="zh"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><title>内存池 - 深入理解Golang设计与实现 - 开源图书(OpenBooks)</title><meta name="description" content=""><script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon"><link rel="next" href="06.2.html"><link rel="prev" href="06.0.html"></head><body><div class="book"><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a><h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".">内存池</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div id="book-search-results"><div class="search-noresults"><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script><section class="normal markdown-section"><h1 id="61-&#x5185;&#x5B58;&#x6C60;">6.1 &#x5185;&#x5B58;&#x6C60;</h1><h2 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h2><p>Go&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x91C7;&#x7528;&#x4E86;&#x8DDF;tcmalloc&#x5E93;&#x76F8;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x5185;&#x5B58;&#x6C60;&#x7684;&#x5206;&#x914D;&#x5668;&#xFF0C;&#x5E95;&#x5C42;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;mmap&#x7B49;&#x51FD;&#x6570;&#x3002;</p><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x6C60;&#xFF0C;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#x8DDF;&#x5B83;&#x76F8;&#x5173;&#x7684;&#x57FA;&#x672C;&#x90E8;&#x5206;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x4F1A;&#x5411;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x5927;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5B58;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6C60;&#x5B50;&#xFF0C;&#x5F53;&#x4E0A;&#x5C42;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x65F6;&#x5B83;&#x4E0D;&#x5B9E;&#x9645;&#x5F52;&#x8FD8;&#x7ED9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x662F;&#x653E;&#x56DE;&#x6C60;&#x5B50;&#x91CD;&#x590D;&#x5229;&#x7528;&#x3002;&#x63A5;&#x7740;&#xFF0C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E2D;&#x5FC5;&#x7136;&#x4F1A;&#x8003;&#x8651;&#x7684;&#x5C31;&#x662F;&#x5185;&#x5B58;&#x788E;&#x7247;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x63D0;&#x9AD8;&#x5185;&#x5B58;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x50CF;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x9996;&#x6B21;&#x9002;&#x5E94;&#xFF0C;&#x6700;&#x4F73;&#x9002;&#x5E94;&#xFF0C;&#x6700;&#x5DEE;&#x9002;&#x5E94;&#xFF0C;&#x4F19;&#x4F34;&#x7B97;&#x6CD5;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x80CC;&#x666F;&#x77E5;&#x8BC6;&#x3002;&#x53E6;&#x5916;&#xFF0C;Go&#x662F;&#x4E00;&#x4E2A;&#x652F;&#x6301;goroutine&#x8FD9;&#x79CD;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x4E5F;&#x8981;&#x8003;&#x8651;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E0B;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x6548;&#x7387;&#x95EE;&#x9898;&#x3002;</p><p>&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x65B9;&#x9762;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5730;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x5206;&#x914D;&#x94FE;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x540E;&#x5C31;&#x5411;&#x5168;&#x5C40;&#x5206;&#x914D;&#x94FE;&#x4E2D;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x65F6;&#x7684;&#x52A0;&#x9501;&#x3002; &#x5728;&#x907F;&#x514D;&#x5185;&#x5B58;&#x788E;&#x7247;&#x65B9;&#x9762;&#xFF0C;&#x5927;&#x5757;&#x5185;&#x5B58;&#x76F4;&#x63A5;&#x6309;&#x9875;&#x4E3A;&#x5355;&#x4F4D;&#x5206;&#x914D;&#xFF0C;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#x4F1A;&#x5207;&#x6210;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5757;&#xFF0C;&#x7533;&#x8BF7;&#x505A;&#x4EFB;&#x610F;&#x5B57;&#x8282;&#x5185;&#x5B58;&#x65F6;&#x4F1A;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#x5230;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x5757;&#xFF0C;&#x5C06;&#x6574;&#x5757;&#x5206;&#x914D;&#x7ED9;&#x7533;&#x8BF7;&#x8005;&#x4EE5;&#x907F;&#x514D;&#x968F;&#x610F;&#x5207;&#x5272;&#x3002;</p><p>Go&#x4E2D;&#x4E3A;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7684;MCache(&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x7ED3;&#x6784;&#x4F53;M&#x4E2D;&#x7684;MCache&#x57DF;)&#xFF0C;&#x5C11;&#x91CF;&#x7684;&#x5730;&#x5740;&#x5206;&#x914D;&#x5C31;&#x76F4;&#x63A5;&#x4ECE;MCache&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x5E76;&#x4E14;&#x5B9A;&#x671F;&#x505A;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5C06;&#x7EBF;&#x7A0B;&#x7684;MCache&#x4E2D;&#x7684;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x8FD4;&#x56DE;&#x7ED9;&#x5168;&#x5C40;&#x63A7;&#x5236;&#x5806;&#x3002;&#x5C0F;&#x4E8E;32K&#x4E3A;&#x5C0F;&#x5BF9;&#x8C61;&#xFF0C;&#x5927;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x4ECE;&#x5168;&#x5C40;&#x63A7;&#x5236;&#x5806;&#x4E0A;&#x4EE5;&#x9875;(4k)&#x4E3A;&#x5355;&#x4F4D;&#x8FDB;&#x884C;&#x5206;&#x914D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5927;&#x5BF9;&#x8C61;&#x603B;&#x662F;&#x4EE5;&#x9875;&#x5BF9;&#x9F50;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x9875;&#x53EF;&#x4EE5;&#x5B58;&#x5165;&#x4E00;&#x4E9B;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x5C0F;&#x5BF9;&#x8C61;&#xFF0C;&#x5C0F;&#x5BF9;&#x8C61;&#x4ECE;&#x672C;&#x5730;&#x5185;&#x5B58;&#x94FE;&#x8868;&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x5927;&#x5BF9;&#x8C61;&#x4ECE;&#x4E2D;&#x5FC3;&#x5185;&#x5B58;&#x5806;&#x4E2D;&#x5206;&#x914D;&#x3002;</p><p>&#x5927;&#x7EA6;&#x6709;100&#x79CD;&#x5185;&#x5B58;&#x5757;&#x7C7B;&#x522B;&#xFF0C;&#x6BCF;&#x4E00;&#x7C7B;&#x522B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x5BF9;&#x8C61;&#x7684;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x3002;&#x5C0F;&#x4E8E;32kB&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x88AB;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x5C3A;&#x5BF8;&#x7C7B;&#x522B;&#xFF0C;&#x4ECE;&#x76F8;&#x5E94;&#x7684;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x4E2D;&#x5206;&#x914D;&#x3002;&#x4E00;&#x9875;&#x5185;&#x5B58;&#x53EA;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x88C2;&#x6210;&#x540C;&#x4E00;&#x79CD;&#x5C3A;&#x5BF8;&#x7C7B;&#x522B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x5206;&#x914D;&#x5668;&#x7BA1;&#x7406;&#x3002;</p><p>&#x5206;&#x914D;&#x5668;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5305;&#x62EC;:</p><ul><li>FixAlloc: &#x56FA;&#x5B9A;&#x5927;&#x5C0F;(128kB)&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x7A7A;&#x95F2;&#x94FE;&#x5206;&#x914D;&#x5668;,&#x88AB;&#x5206;&#x914D;&#x5668;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5B58;&#x50A8;</li><li>MHeap: &#x5206;&#x914D;&#x5806;,&#x6309;&#x9875;&#x7684;&#x7C92;&#x5EA6;&#x8FDB;&#x884C;&#x7BA1;&#x7406;(4kB)</li><li>MSpan: &#x4E00;&#x4E9B;&#x7531;MHeap&#x7BA1;&#x7406;&#x7684;&#x9875;</li><li>MCentral: &#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x5C3A;&#x5BF8;&#x7C7B;&#x522B;&#x7684;&#x5171;&#x4EAB;&#x7684;free list</li><li>MCache: &#x7528;&#x4E8E;&#x5C0F;&#x5BF9;&#x8C61;&#x7684;&#x6BCF;M&#x4E00;&#x4E2A;&#x7684;cache</li></ul><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;Go&#x8BED;&#x8A00;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x4E24;&#x7EA7;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7ED3;&#x6784;&#xFF0C;MHeap&#x548C;MCache&#x3002;&#x4E0A;&#x9762;&#x4E00;&#x7EA7;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x662F;&#x9875;&#xFF0C;&#x7528;&#x4E8E;&#x5206;&#x914D;&#x5927;&#x5BF9;&#x8C61;&#xFF0C;&#x6BCF;&#x6B21;&#x5206;&#x914D;&#x90FD;&#x662F;&#x82E5;&#x5E72;&#x8FDE;&#x7EED;&#x7684;&#x9875;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x82E5;&#x5E72;&#x4E2A;4KB&#x7684;&#x5927;&#x5C0F;&#x3002;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;MHeap&#x548C;MSpan&#xFF0C;&#x7528;BestFit&#x7B97;&#x6CD5;&#x505A;&#x5206;&#x914D;&#xFF0C;&#x7528;&#x4F4D;&#x793A;&#x56FE;&#x505A;&#x56DE;&#x6536;&#x3002;&#x4E0B;&#x9762;&#x4E00;&#x7EA7;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x662F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x66F4;&#x50CF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6C60;&#x800C;&#x4E0D;&#x662F;&#x5185;&#x5B58;&#x6C60;&#xFF0C;&#x7528;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x505A;&#x56DE;&#x6536;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x4E00;&#x7EA7;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;MCache&#x3002;</p><h2 id="mheap">MHeap</h2><p>MHeap&#x5C42;&#x6B21;&#x7528;&#x4E8E;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x8F83;&#x5927;(&gt;32kB)&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x7ED9;MCentral&#x548C;MCache&#x7B49;&#x4E0B;&#x5C42;&#x63D0;&#x4F9B;&#x7A7A;&#x95F4;&#x3002;&#x5B83;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x662F;MSpan&#x3002;MSpan&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x82E5;&#x5E72;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x9875;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7B80;&#x5316;&#x540E;&#x5982;&#x4E0B;&#xFF1A;</p><pre><code class="lang-C">    <span class="hljs-keyword">struct</span> MSpan
    {
        PageID    start;        <span class="hljs-comment">// starting page number</span>
        uintptr    npages;        <span class="hljs-comment">// number of pages in span</span>
    };
</code></pre><p>&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x57FA;&#x5730;&#x5740;+(&#x9875;&#x53F7;*&#x9875;&#x5927;&#x5C0F;)&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5B9A;&#x4F4D;&#x5230;&#x8FD9;&#x4E2A;MSpan&#x7684;&#x5B9E;&#x9645;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x57FA;&#x5730;&#x5740;&#x662F;&#x5728;MHeap&#x4E2D;&#x5B58;&#x50A8;&#x4E86;&#x7684;&#x3002;</p><p>MHeap&#x8D1F;&#x8D23;&#x5C06;MSpan&#x7EC4;&#x7EC7;&#x548C;&#x7BA1;&#x7406;&#x8D77;&#x6765;&#xFF0C;MHeap&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;</p><p><img src="images/6.1.mheap.jpg?raw=true" alt=""></p><p>free&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x914D;&#x6C60;&#xFF0C;&#x4ECE;free[i]&#x51FA;&#x53BB;&#x7684;MSpan&#x6BCF;&#x4E2A;&#x5927;&#x5C0F;&#x90FD;i&#x9875;&#x7684;,&#x603B;&#x5171;256&#x4E2A;&#x69FD;&#x4F4D;&#x3002;&#x518D;&#x5927;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5927;&#x5C0F;&#x5C31;&#x4E0D;&#x56FA;&#x5B9A;&#x4E86;&#xFF0C;&#x7531;large&#x94FE;&#x8D77;&#x6765;&#x3002;</p><p>&#x5206;&#x914D;&#x8FC7;&#x7A0B;&#xFF1A; &#x5982;&#x679C;&#x80FD;&#x4ECE;free[]&#x7684;&#x5206;&#x914D;&#x6C60;&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x5219;&#x4ECE;&#x5176;&#x4E2D;&#x5206;&#x914D;&#x3002;&#x5982;&#x679C;&#x53D1;&#x751F;&#x5207;&#x5272;&#x5219;&#x5C06;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x653E;&#x56DE;free[]&#x4E2D;&#x3002;&#x6BD4;&#x5982;&#x8981;&#x5206;&#x914D;2&#x9875;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4ECE;&#x56FE;&#x4E0A;2&#x53F7;&#x69FD;&#x4F4D;&#x5F00;&#x59CB;&#x5BFB;&#x627E;&#xFF0C;&#x76F4;&#x5230;4&#x53F7;&#x69FD;&#x4F4D;&#x6709;&#x53EF;&#x7528;&#x7684;MSpan&#xFF0C;&#x5219;&#x62FF;&#x4E00;&#x4E2A;&#x51FA;&#x6765;&#xFF0C;&#x5207;&#x51FA;&#x4E24;&#x9875;&#xFF0C;&#x5269;&#x4F59;&#x7684;&#x90E8;&#x5206;&#x518D;&#x653E;&#x56DE;2&#x53F7;&#x69FD;&#x4F4D;&#x4E2D;&#x3002; &#x5426;&#x5219;&#x4ECE;large&#x94FE;&#x8868;&#x4E2D;&#x53BB;&#x5206;&#x914D;&#xFF0C;&#x6309;BestFit&#x7B97;&#x6CD5;&#x53BB;&#x627E;&#x4E00;&#x5757;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x3002;</p><p>&#x5316;&#x6574;&#x4E3A;&#x96F6;&#x7B80;&#x5355;&#xFF0C;&#x5316;&#x96F6;&#x4E3A;&#x6574;&#x9EBB;&#x70E6;&#x3002;&#x56DE;&#x6536;&#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x76F8;&#x90BB;&#x7684;&#x5757;&#x662F;&#x672A;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x8981;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x5426;&#x5219;&#x4E00;&#x76F4;&#x5212;&#x5206;&#x4E0B;&#x53BB;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x591A;&#x788E;&#x7247;&#xFF0C;&#x627E;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x5C0F;&#x7684;&#x8FDE;&#x7EED;&#x7A7A;&#x95F4;&#x3002;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x5408;&#x5E76;&#xFF0C;&#x56DE;&#x6536;&#x4F1A;&#x6BD4;&#x5206;&#x914D;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF0C;&#x6240;&#x6709;&#x5C31;&#x6709;&#x4EC0;&#x4E48;&#x4F19;&#x4F34;&#x7B97;&#x6CD5;&#xFF0C;&#x8FB9;&#x754C;&#x6807;&#x8BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x4F4D;&#x793A;&#x56FE;&#x4E4B;&#x7C7B;&#x7684;&#x3002;</p><p>Go&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x7684;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F4D;&#x793A;&#x56FE;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;MHeap&#x4E2D;&#x6709;&#x4E00;&#x4E2A;</p><pre><code class="lang-C">    MSpan *<span class="hljs-built_in">map</span>[<span class="hljs-number">1</span>&lt;&lt;MHeapMap_Bits];
</code></pre><p>&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5C06;&#x5185;&#x5B58;&#x5730;&#x5740;&#x6620;&#x5C04;&#x6210;MSpan&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x5185;&#x5B58;&#x9875;&#x90FD;&#x4F1A;&#x5BF9;&#x5E94;&#x5230;map&#x4E2D;&#x7684;&#x4E00;&#x4E2A;MSpan&#x6307;&#x9488;&#xFF0C;&#x901A;&#x8FC7;map&#x5C31;&#x80FD;&#x591F;&#x5C06;&#x5730;&#x5740;&#x6620;&#x5C04;&#x5230;&#x76F8;&#x5E94;&#x7684;MSpan&#x3002;&#x5177;&#x4F53;&#x505A;&#x6CD5;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;(&#x5730;&#x5740;-&#x57FA;&#x5730;&#x5740;)/&#x9875;&#x5927;&#x5C0F;&#x5F97;&#x5230;&#x9875;&#x53F7;&#xFF0C;&#x518D;&#x901A;&#x8FC7;map[&#x9875;&#x53F7;]&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x76F8;&#x5E94;&#x7684;MSpan&#x7ED3;&#x6784;&#x4F53;&#x3002;&#x524D;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;MSpan&#x5C31;&#x662F;&#x82E5;&#x5E72;&#x8FDE;&#x7EED;&#x7684;&#x9875;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4E00;&#x4E2A;&#x591A;&#x9875;&#x7684;MSpan&#x4F1A;&#x5360;&#x7528;map&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x591A;&#x9879;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x9875;&#x5C31;&#x4F1A;&#x5360;&#x7528;&#x591A;&#x5C11;&#x9879;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x53EF;&#x80FD;map[502]&#x5230;map[505]&#x90FD;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;MSpan&#xFF0C;&#x8FD9;&#x4E2A;MSpan&#x7684;PageId&#x4E3A;502&#xFF0C;npages&#x4E3A;4&#x3002;</p><p>&#x56DE;&#x6536;&#x8FC7;&#x7A0B;&#xFF1A; &#x56DE;&#x6536;&#x4E00;&#x4E2A;MSpan&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x4F1A;&#x67E5;&#x627E;&#x5B83;&#x76F8;&#x90BB;&#x7684;&#x9875;&#x7684;&#x5740;&#x5740;&#xFF0C;&#x518D;&#x901A;&#x8FC7;map&#x6620;&#x5C04;&#x5F97;&#x5230;&#x8BE5;&#x9875;&#x5BF9;&#x5E94;&#x7684;MSpan&#xFF0C;&#x5982;&#x679C;MSpan&#x7684;state&#x662F;&#x672A;&#x4F7F;&#x7528;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5C06;&#x4E24;&#x8005;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x3002;&#x6700;&#x540E;&#x4F1A;&#x5C06;&#x8FD9;&#x9875;&#x6216;&#x8005;&#x5408;&#x5E76;&#x540E;&#x7684;&#x9875;&#x5F52;&#x8FD8;&#x5230;free[]&#x5206;&#x914D;&#x6C60;&#x6216;&#x8005;&#x662F;large&#x4E2D;&#x3002;</p><h2 id="mcache">MCache</h2><p>MCache&#x5C42;&#x6B21;&#x8DDF;MHeap&#x5C42;&#x6B21;&#x975E;&#x5E38;&#x50CF;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x914D;&#x6C60;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x5C3A;&#x5BF8;&#x7684;&#x7C7B;&#x522B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x5BF9;&#x8C61;&#x7684;&#x5355;&#x94FE;&#x8868;&#x3002;Go&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x4E24;&#x7EA7;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x4E0A;&#x9762;&#x4E00;&#x7EA7;&#x662F;MHeap&#x5C42;&#x6B21;&#xFF0C;&#x800C;MCache&#x5219;&#x662F;&#x4E0B;&#x9762;&#x4E00;&#x7EA7;&#x3002;</p><p>&#x6BCF;&#x4E2A;M&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x5C40;&#x90E8;&#x5185;&#x5B58;&#x7F13;&#x5B58;MCache&#xFF0C;&#x8FD9;&#x6837;&#x5206;&#x914D;&#x5C0F;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x4ECE;MCache&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x52A0;&#x9501;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;Go&#x80FD;&#x591F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#x9AD8;&#x6548;&#x5730;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x3002;MCache&#x662F;&#x7528;&#x4E8E;&#x5C0F;&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x3002;</p><p>&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5C0F;&#x5BF9;&#x8C61;(&lt;32kB)&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p><ol><li>&#x5C06;&#x5C0F;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#x5230;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x5C3A;&#x5BF8;&#x7C7B;&#x522B;&#xFF0C;&#x67E5;&#x627E;&#x76F8;&#x5E94;&#x7684;MCache&#x7684;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x3002;&#x5982;&#x679C;&#x94FE;&#x8868;&#x4E0D;&#x7A7A;&#xFF0C;&#x76F4;&#x63A5;&#x4ECE;&#x4E0A;&#x9762;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x52A0;&#x9501;&#x3002;</li><li>&#x5982;&#x679C;MCache&#x81EA;&#x7531;&#x94FE;&#x662F;&#x7A7A;&#x7684;,&#x901A;&#x8FC7;&#x4ECE;MCentral&#x81EA;&#x7531;&#x94FE;&#x62FF;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x8865;&#x5145;&#x3002;</li><li>&#x5982;&#x679C;MCentral&#x81EA;&#x7531;&#x94FE;&#x662F;&#x7A7A;&#x7684;,&#x5219;&#x901A;&#x8FC7;MHeap&#x4E2D;&#x62FF;&#x4E00;&#x4E9B;&#x9875;&#x5BF9;MCentral&#x8FDB;&#x884C;&#x8865;&#x5145;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x622A;&#x65AD;&#x6210;&#x89C4;&#x5B9A;&#x7684;&#x5927;&#x5C0F;&#x3002;</li><li>&#x5982;&#x679C;MHeap&#x662F;&#x7A7A;&#x7684;,&#x6216;&#x8005;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x5927;&#x5C0F;&#x7684;&#x9875;&#x4E86;,&#x4ECE;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x4E00;&#x7EC4;&#x65B0;&#x7684;&#x9875;(&#x81F3;&#x5C11;1MB)&#x3002;&#x5206;&#x914D;&#x4E00;&#x5927;&#x6279;&#x7684;&#x9875;&#x5206;&#x644A;&#x4E86;&#x4ECE;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x7684;&#x5F00;&#x9500;&#x3002;</li></ol><p>&#x6CE8;&#x610F;&#x4E0A;&#x9762;&#x8868;&#x8FF0;&#x4E2D;&#x7684;&#x7528;&#x8BCD;&#x201C;&#x4E00;&#x4E9B;&#x201D;&#x3002;&#x4ECE;MCentral&#x4E2D;&#x62FF;&#x201C;&#x4E00;&#x4E9B;&#x201C;&#x81EA;&#x7531;&#x94FE;&#x5BF9;&#x8C61;&#x8865;&#x5145;MCache&#x5206;&#x644A;&#x4E86;&#x8BBF;&#x95EE;MCentral&#x52A0;&#x9501;&#x7684;&#x5F00;&#x9500;&#x3002;&#x4ECE;MHeap&#x4E2D;&#x5206;&#x914D;&#x201C;&#x4E00;&#x4E9B;&#x201C;&#x7684;&#x9875;&#x8865;&#x5145;MCentral&#x5206;&#x644A;&#x4E86;&#x5BF9;MHeap&#x52A0;&#x9501;&#x7684;&#x5F00;&#x9500;&#x3002;</p><p>&#x91CA;&#x653E;&#x4E00;&#x4E2A;&#x5C0F;&#x5BF9;&#x8C61;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x8FC7;&#x7A0B;:</p><ol><li>&#x67E5;&#x627E;&#x5BF9;&#x8C61;&#x6240;&#x5C5E;&#x7684;&#x5C3A;&#x5BF8;&#x7C7B;&#x522B;&#xFF0C;&#x5C06;&#x5B83;&#x6DFB;&#x52A0;&#x5230;MCache&#x7684;&#x81EA;&#x7531;&#x94FE;&#x3002;</li><li>&#x5982;&#x679C;MCache&#x81EA;&#x7531;&#x94FE;&#x592A;&#x957F;&#x6216;&#x8005;MCache&#x5185;&#x5B58;&#x5927;&#x591A;&#x4E86;&#xFF0C;&#x5219;&#x8FD4;&#x8FD8;&#x4E00;&#x4E9B;&#x5230;MCentral&#x81EA;&#x7531;&#x94FE;&#x3002;</li><li>&#x5982;&#x679C;&#x5728;&#x67D0;&#x4E2A;&#x8303;&#x56F4;&#x7684;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x5F52;&#x8FD8;&#x5230;MCentral&#x94FE;&#x4E86;&#xFF0C;&#x5219;&#x5C06;&#x5B83;&#x4EEC;&#x5F52;&#x8FD8;&#x5230;&#x9875;&#x5806;&#x3002;</li></ol><p>&#x5F52;&#x8FD8;&#x5230;MHeap&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x5F52;&#x8FD8;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p><p>MCache&#x5C42;&#x6B21;&#x4EC5;&#x7528;&#x4E8E;&#x5206;&#x914D;&#x5C0F;&#x5BF9;&#x8C61;&#xFF0C;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#x5219;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;MHeap&#x7684;&#xFF0C;&#x8DF3;&#x8FC7;MCache&#x548C;MCentral&#x81EA;&#x7531;&#x94FE;&#x3002;MCache&#x548C;MCentral&#x4E2D;&#x81EA;&#x7531;&#x94FE;&#x7684;&#x5C0F;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x662F;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x6E05;0&#x4E86;&#x7684;&#x3002;&#x5BF9;&#x8C61;&#x7684;&#x7B2C;2&#x4E2A;&#x5B57;&#x8282;&#x4F5C;&#x4E3A;&#x6807;&#x8BB0;&#xFF0C;&#x5F53;&#x5B83;&#x662F;0&#x65F6;&#xFF0C;&#x6B64;&#x5BF9;&#x8C61;&#x662F;&#x6E05;0&#x4E86;&#x7684;&#x3002;&#x9875;&#x5806;&#x4E2D;&#x7684;&#x603B;&#x662F;&#x6E05;&#x96F6;&#x7684;&#xFF0C;&#x5F53;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x5BF9;&#x8C61;&#x5F52;&#x8FD8;&#x5230;&#x9875;&#x5806;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x6E05;&#x96F6;&#x3002;&#x8FD9;&#x6837;&#x624D;&#x7B26;&#x5408;Go&#x8BED;&#x8A00;&#x89C4;&#x8303;&#xFF1A;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0D;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5B83;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x662F;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x96F6;&#x503C;&#x3002;</p><h2 id="mcentral">MCentral</h2><p>MCentral&#x5C42;&#x6B21;&#x662F;&#x4F5C;&#x4E3A;MCache&#x548C;MHeap&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x5BF9;&#x4E0A;&#xFF0C;&#x5B83;&#x4ECE;MHeap&#x4E2D;&#x7533;&#x8BF7;MSpan&#xFF1B;&#x5BF9;&#x4E0B;&#xFF0C;&#x5B83;&#x5C06;MSpan&#x5212;&#x5206;&#x6210;&#x5404;&#x79CD;&#x5C0F;&#x5C3A;&#x5BF8;&#x5BF9;&#x8C61;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;MCache&#x4F7F;&#x7528;&#x3002;</p><pre><code class="lang-C">    <span class="hljs-keyword">struct</span> MCentral
    {
        Lock;
        int32 sizeclass;
        MSpan nonempty;
        MSpan empty;
        int32 nfree;
    };
</code></pre><p>&#x6CE8;&#x610F;&#xFF0C;&#x6BCF;&#x4E2A;MSpan&#x53EA;&#x4F1A;&#x5206;&#x5272;&#x6210;&#x540C;&#x79CD;&#x5927;&#x5C0F;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6BCF;&#x4E2A;MCentral&#x4E5F;&#x662F;&#x53EA;&#x542B;&#x540C;&#x79CD;&#x5927;&#x5C0F;&#x7684;&#x5BF9;&#x8C61;&#x3002;MCentral&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;nonempty&#x7684;MSpan&#x94FE;&#x548C;&#x4E00;&#x4E2A;empty&#x7684;MSpan&#x94FE;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x8FD8;&#x6709;&#x7A7A;&#x95F4;&#x7684;MSpan&#x548C;&#x88C5;&#x6EE1;&#x4E86;&#x5BF9;&#x8C61;&#x7684;MSpan&#x3002;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF1A; <img src="images/6.1.mcentral.jpg?raw=true" alt=""></p><p>&#x5206;&#x914D;&#x8FD8;&#x662F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x76F4;&#x63A5;&#x4ECE;MCentral-&gt;nonempty-&gt;freelist&#x5206;&#x914D;&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;freelist&#x7A7A;&#x4E86;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x8FD9;&#x4E00;&#x5757;MSpan&#x6EE1;&#x4E86;&#xFF0C;&#x5C06;&#x5B83;&#x79FB;&#x5230;MCentral-&gt;empty&#x3002; &#x524D;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;&#x56DE;&#x6536;&#x6BD4;&#x5206;&#x914D;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x5408;&#x5E76;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5408;&#x5E76;&#x662F;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x4ECE;MSpan&#x4E2D;&#x6BCF;&#x5212;&#x51FA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x52A0;&#x4E00;&#xFF0C;&#x6BCF;&#x56DE;&#x6536;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x51CF;&#x4E00;&#x3002;&#x5982;&#x679C;&#x51CF;&#x5B8C;&#x4E4B;&#x540E;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E3A;&#x96F6;&#x4E86;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x8FD9;&#x6574;&#x5757;&#x7684;MSpan&#x5DF2;&#x7ECF;&#x6CA1;&#x88AB;&#x4F7F;&#x7528;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x5F52;&#x8FD8;&#x7ED9;MHeap&#x3002;</p><h2 id="&#x5176;&#x5B83;">&#x5176;&#x5B83;</h2><p>&#x672C;&#x8282;&#x7684;&#x5185;&#x5B58;&#x6C60;&#x6D89;&#x53CA;&#x7684;&#x6587;&#x4EF6;&#x5305;&#x62EC;&#xFF1A;</p><ul><li>malloc.h &#x5934;&#x6587;&#x4EF6;</li><li>malloc.goc &#x6700;&#x5916;&#x5C42;&#x7684;&#x5305;&#x88C5;</li><li>msize.c &#x5C06;&#x5404;&#x79CD;&#x5927;&#x5C0F;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x5C3A;&#x5BF8;&#x7C7B;&#x522B;</li><li>mheap.c &#x5BF9;&#x5E94;MHeap&#x4E2D;&#x76F8;&#x5173;&#x5B9E;&#x73B0;,&#x8FD8;&#x6709;MSpan</li><li>mcache.c &#x5BF9;&#x5E94;MCache&#x4E2D;&#x76F8;&#x5173;&#x5B9E;&#x73B0;</li><li>mcentral.c &#x5BF9;&#x5E94;MCentral&#x4E2D;&#x76F8;&#x5173;&#x5B9E;&#x73B0;</li><li>mem_linux.c SysAlloc&#x7B49;sys&#x76F8;&#x5173;&#x7684;&#x5B9E;&#x73B0;</li></ul></section><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div><a href="06.0.html" class="navigation navigation-prev" aria-label="上一页: 内存管理"><i class="fa fa-angle-left"></i> </a><a href="06.2.html" class="navigation navigation-next" aria-label="下一页: 垃圾回收上篇"><i class="fa fa-angle-right"></i></a></div><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="輸入並搜尋"></div><nav role="navigation"><ul class="summary"><li class="chapter" data-level="1.1" data-path="./"><a href="./">简介</a></li><li class="chapter" data-level="1.2" data-path="01.0.html"><a href="01.0.html">如何研究Go内部实现</a><ul class="articles"><li class="chapter" data-level="1.2.1" data-path="01.1.html"><a href="01.1.html">从源代码安装Go</a></li><li class="chapter" data-level="1.2.2" data-path="01.2.html"><a href="01.2.html">本书的组织结构</a></li><li class="chapter" data-level="1.2.3" data-path="01.3.html"><a href="01.3.html">基本技巧</a></li></ul></li><li class="chapter" data-level="1.3" data-path="02.0.html"><a href="02.0.html">基本数据结构</a><ul class="articles"><li class="chapter" data-level="1.3.1" data-path="02.1.html"><a href="02.1.html">基本类型</a></li><li class="chapter" data-level="1.3.2" data-path="02.2.html"><a href="02.2.html">slice</a></li><li class="chapter" data-level="1.3.3" data-path="02.3.html"><a href="02.3.html">map的实现</a></li><li class="chapter" data-level="1.3.4" data-path="02.4.html"><a href="02.4.html">nil</a></li></ul></li><li class="chapter" data-level="1.4" data-path="03.0.html"><a href="03.0.html">函数调用协议</a><ul class="articles"><li class="chapter" data-level="1.4.1" data-path="03.1.html"><a href="03.1.html">Go调用汇编和C</a></li><li class="chapter" data-level="1.4.2" data-path="03.2.html"><a href="03.2.html">多值返回</a></li><li class="chapter" data-level="1.4.3" data-path="03.3.html"><a href="03.3.html">go关键字</a></li><li class="chapter" data-level="1.4.4" data-path="03.4.html"><a href="03.4.html">defer关键字</a></li><li class="chapter" data-level="1.4.5" data-path="03.5.html"><a href="03.5.html">连续栈</a></li><li class="chapter" data-level="1.4.6" data-path="03.6.html"><a href="03.6.html">闭包的实现</a></li></ul></li><li class="chapter" data-level="1.5" data-path="04.0.html"><a href="04.0.html">Go语言程序初始化过程</a><ul class="articles"><li class="chapter" data-level="1.5.1" data-path="04.1.html"><a href="04.1.html">系统初始化</a></li><li class="chapter" data-level="1.5.2" data-path="04.2.html"><a href="04.2.html">main.main之前的准备</a></li></ul></li><li class="chapter" data-level="1.6" data-path="05.0.html"><a href="05.0.html">goroutine调度</a><ul class="articles"><li class="chapter" data-level="1.6.1" data-path="05.1.html"><a href="05.1.html">调度器相关数据结构</a></li><li class="chapter" data-level="1.6.2" data-path="05.2.html"><a href="05.2.html">goroutine的生老病死</a></li><li class="chapter" data-level="1.6.3" data-path="05.3.html"><a href="05.3.html">设计与演化</a></li><li class="chapter" data-level="1.6.4"><span>[死锁检测和竞态检测]</span></li><li class="chapter" data-level="1.6.5" data-path="05.5.html"><a href="05.5.html">抢占式调度</a></li></ul></li><li class="chapter" data-level="1.7" data-path="06.0.html"><a href="06.0.html">内存管理</a><ul class="articles"><li class="chapter active" data-level="1.7.1" data-path="06.1.html"><a href="06.1.html">内存池</a></li><li class="chapter" data-level="1.7.2" data-path="06.2.html"><a href="06.2.html">垃圾回收上篇</a></li><li class="chapter" data-level="1.7.3" data-path="06.3.html"><a href="06.3.html">垃圾回收下篇</a></li></ul></li><li class="chapter" data-level="1.8" data-path="07.0.html"><a href="07.0.html">高级数据结构的实现</a><ul class="articles"><li class="chapter" data-level="1.8.1" data-path="07.1.html"><a href="07.1.html">channel</a></li><li class="chapter" data-level="1.8.2" data-path="07.2.html"><a href="07.2.html">interface</a></li><li class="chapter" data-level="1.8.3" data-path="07.3.html"><a href="07.3.html">方法调用</a></li></ul></li><li class="chapter" data-level="1.9" data-path="08.0.html"><a href="08.0.html">网络</a><ul class="articles"><li class="chapter" data-level="1.9.1" data-path="08.1.html"><a href="08.1.html">非阻塞io</a></li><li class="chapter" data-level="1.9.2"><span>[net包]</span></li></ul></li><li class="chapter" data-level="1.10" data-path="09.0.html"><a href="09.0.html">cgo</a><ul class="articles"><li class="chapter" data-level="1.10.1" data-path="09.1.html"><a href="09.1.html">预备知识</a></li><li class="chapter" data-level="1.10.2" data-path="09.2.html"><a href="09.2.html">cgo关键技术</a></li><li class="chapter" data-level="1.10.3" data-path="09.3.html"><a href="09.3.html">Go调用C</a></li><li class="chapter" data-level="1.10.4" data-path="09.4.html"><a href="09.4.html">C调用Go</a></li></ul></li><li class="chapter" data-level="1.11"><span>[杂项]</span><ul class="articles"><li class="chapter" data-level="1.11.1" data-path="10.1.html"><a href="10.1.html">内存模型</a></li><li class="chapter" data-level="1.11.2"><span>[pprof]</span></li><li class="chapter" data-level="1.11.3"><span>[底层同步机制]</span></li><li class="chapter" data-level="1.11.4" data-path="10.4.html"><a href="10.4.html">系统调用</a></li><li class="chapter" data-level="1.11.5"><span>[timer]</span></li><li class="chapter" data-level="1.11.6" data-path="10.7.html"><a href="10.7.html">运行时符号信息</a></li><li class="chapter" data-level="1.11.7"><span>[signal处理]</span></li></ul></li><li class="divider"></li><li><a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a></li></ul></nav></div><script>var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"内存池","level":"1.7.1","depth":2,"next":{"title":"垃圾回收上篇","level":"1.7.2","depth":2,"path":"06.2.md","ref":"06.2.md","articles":[]},"previous":{"title":"内存管理","level":"1.7","depth":1,"path":"06.0.md","ref":"06.0.md","articles":[{"title":"内存池","level":"1.7.1","depth":2,"path":"06.1.md","ref":"06.1.md","articles":[]},{"title":"垃圾回收上篇","level":"1.7.2","depth":2,"path":"06.2.md","ref":"06.2.md","articles":[]},{"title":"垃圾回收下篇","level":"1.7.3","depth":2,"path":"06.3.md","ref":"06.3.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git","minifier"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"minifier":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深入理解Golang设计与实现","language":"zh","gitbook":"*"},"file":{"path":"06.1.md","mtime":"2020-10-18T13:41:23.985Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T13:41:59.918Z"},"basePath":".","book":{"language":"zh"}});
        });</script></div><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script><script src="../gitbook/gitbook-plugin-search/search-engine.js"></script><script src="../gitbook/gitbook-plugin-search/search.js"></script><script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script><script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script><script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script><script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script><script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script><script>window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();</script></body></html>