<!DOCTYPE HTML><html lang="zh"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><title>垃圾回收上篇 - 深入理解Golang设计与实现 - 开源图书(OpenBooks)</title><meta name="description" content=""><script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon"><link rel="next" href="06.3.html"><link rel="prev" href="06.1.html"></head><body><div class="book"><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a><h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".">垃圾回收上篇</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div id="book-search-results"><div class="search-noresults"><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script><section class="normal markdown-section"><h1 id="62-&#x5783;&#x573E;&#x56DE;&#x6536;">6.2 &#x5783;&#x573E;&#x56DE;&#x6536;</h1><p>Go&#x8BED;&#x8A00;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7B97;&#x6CD5;&#x3002;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x4F1A;stoptheworld&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5728;&#x5F53;&#x524D;1.3&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x548C;&#x5E76;&#x884C;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5927;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x4F1A;&#x957F;&#x65F6;&#x95F4;&#x5361;&#x4F4F;&#x3002;</p><h2 id="&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7B97;&#x6CD5;">&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7B97;&#x6CD5;</h2><p>&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x57FA;&#x7840;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#x521D;&#x59CB;&#x7684;root&#x533A;&#x57DF;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x53D7;&#x63A7;&#x5806;&#x533A;&#x3002;root&#x533A;&#x57DF;&#x4E3B;&#x8981;&#x662F;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x5230;&#x5F53;&#x524D;&#x65F6;&#x523B;&#x7684;&#x6808;&#x548C;&#x5168;&#x5C40;&#x6570;&#x636E;&#x533A;&#x57DF;&#x3002;&#x5728;&#x53D7;&#x63A7;&#x5806;&#x533A;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x6570;&#x636E;&#x662F;&#x7A0B;&#x5E8F;&#x4EE5;&#x540E;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x4F5C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4E86;&#x3002;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x4E3A;&#x5783;&#x573E;&#xFF0C;&#x5C31;&#x662F;&#x770B;&#x4ECE;root&#x533A;&#x57DF;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x6709;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x7684;&#x5F15;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x5230;&#x5B83;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x5B83;&#x6CA1;&#x6709;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5F53;&#x4F5C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6389;&#x3002;</p><p>&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7B97;&#x6CD5;&#x5206;&#x4E3A;&#x4E24;&#x9636;&#x6BB5;&#xFF1A;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x548C;&#x6E05;&#x626B;&#x9636;&#x6BB5;&#x3002;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#xFF0C;&#x4ECE;root&#x533A;&#x57DF;&#x51FA;&#x53D1;&#xFF0C;&#x626B;&#x63CF;&#x6240;&#x6709;root&#x533A;&#x57DF;&#x7684;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5F15;&#x7528;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x5BF9;&#x4E0A;&#x5168;&#x90E8;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#x3002;&#x5728;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#xFF0C;&#x626B;&#x63CF;&#x6574;&#x4E2A;&#x5806;&#x533A;&#xFF0C;&#x5BF9;&#x6240;&#x6709;&#x65E0;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;(&#x8865;&#x56FE;)</p><h2 id="&#x4F4D;&#x56FE;&#x6807;&#x8BB0;&#x548C;&#x5185;&#x5B58;&#x5E03;&#x5C40;">&#x4F4D;&#x56FE;&#x6807;&#x8BB0;&#x548C;&#x5185;&#x5B58;&#x5E03;&#x5C40;</h2><p>&#x65E2;&#x7136;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x8981;&#x6C42;&#x7ED9;&#x5BF9;&#x8C61;&#x52A0;&#x4E0A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x663E;&#x7136;&#x662F;&#x9700;&#x8981;&#x6709;&#x6807;&#x8BB0;&#x4F4D;&#x7684;&#x3002;&#x4E00;&#x822C;&#x7684;&#x505A;&#x6CD5;&#x4F1A;&#x5C06;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#x57DF;&#xFF0C;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#x7684;&#x505A;&#x6CD5;&#x4F1A;&#x5229;&#x7528;&#x5BF9;&#x8C61;&#x6307;&#x9488;&#x7684;&#x4F4E;&#x4F4D;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#xFF0C;&#x8FD9;&#x90FD;&#x53EA;&#x662F;&#x4E9B;&#x5947;&#x6280;&#x6DEB;&#x5DE7;&#x7F62;&#x4E86;&#x3002;Go&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x548C;C&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x5BF9;&#x8C61;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x975E;&#x4FB5;&#x5165;&#x5F0F;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p>&#x5806;&#x533A;&#x57DF;&#x5BF9;&#x5E94;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x533A;&#x57DF;&#xFF0C;&#x5806;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B57;(&#x4E0D;&#x662F;byte&#xFF0C;&#x800C;&#x662F;word)&#x90FD;&#x4F1A;&#x5728;&#x6807;&#x8BB0;&#x4F4D;&#x533A;&#x57DF;&#x4E2D;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x3002;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x5B57;(32&#x4F4D;&#x6216;64&#x4F4D;)&#x4F1A;&#x5BF9;&#x5E94;4&#x4F4D;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;64&#x4F4D;&#x7CFB;&#x7EDF;&#x4E2D;&#x76F8;&#x5F53;&#x4E8E;&#x6BCF;&#x4E2A;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x7684;&#x5B57;&#x8282;&#x5BF9;&#x5E94;16&#x4E2A;&#x5806;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#x3002;</p><p>&#x867D;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x5806;&#x5B57;&#x8282;&#x5BF9;&#x5E94;4&#x4F4D;&#x6807;&#x8BB0;&#x4F4D;&#xFF0C;&#x4F46;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x533A;&#x57DF;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x5E76;&#x4E0D;&#x662F;&#x6309;4&#x4F4D;&#x4E00;&#x7EC4;&#xFF0C;&#x800C;&#x662F;16&#x4E2A;&#x5806;&#x5B57;&#x8282;&#x4E3A;&#x4E00;&#x7EC4;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x4FE1;&#x606F;&#x6253;&#x5305;&#x5B58;&#x50A8;&#x7684;&#x3002;&#x6BCF;&#x7EC4;64&#x4F4D;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x4F9D;&#x6B21;&#x5305;&#x62EC;&#xFF1A;</p><pre><code>16&#x4F4D;&#x7684; &#x7279;&#x6B8A;&#x4F4D; &#x6807;&#x8BB0;&#x4F4D;
16&#x4F4D;&#x7684; &#x5783;&#x573E;&#x56DE;&#x6536; &#x6807;&#x8BB0;&#x4F4D;
16&#x4F4D;&#x7684; &#x65E0;&#x6307;&#x9488;/&#x5757;&#x8FB9;&#x754C; &#x7684;&#x6807;&#x8BB0;&#x4F4D;
16&#x4F4D;&#x7684; &#x5DF2;&#x5206;&#x914D; &#x6807;&#x8BB0;&#x4F4D;
</code></pre><p>&#x8FD9;&#x6837;&#x8BBE;&#x8BA1;&#x4F7F;&#x5F97;&#x5BF9;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x5F88;&#x5BB9;&#x6613;&#x3002;</p><p>&#x524D;&#x9762;&#x63D0;&#x5230;&#x5806;&#x533A;&#x57DF;&#x548C;&#x5806;&#x5730;&#x5740;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x533A;&#x57DF;&#x662F;&#x5206;&#x5F00;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x5B83;&#x4EEC;&#x662F;&#x4EE5;mheap.arena_start&#x5730;&#x5740;&#x4E3A;&#x8FB9;&#x754C;&#xFF0C;&#x5411;&#x4E0A;&#x662F;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x5806;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5411;&#x4E0B;&#x5219;&#x662F;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x533A;&#x57DF;&#x3002;&#x4EE5;64&#x4F4D;&#x7CFB;&#x7EDF;&#x4E3A;&#x4F8B;&#xFF0C;&#x8BA1;&#x7B97;&#x5806;&#x4E2D;&#x67D0;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x7684;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p><pre><code>&#x504F;&#x79FB; = &#x5730;&#x5740; - mheap.arena_start
&#x6807;&#x8BB0;&#x4F4D;&#x5730;&#x5740; = mheap.arena_start - &#x504F;&#x79FB;/16 - 1
&#x79FB;&#x4F4D; = &#x504F;&#x79FB; % 16
&#x6807;&#x8BB0;&#x4F4D; = *&#x6807;&#x8BB0;&#x4F4D;&#x5730;&#x5740; &gt;&gt; &#x79FB;&#x4F4D;
</code></pre><p>&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; (&#x6807;&#x8BB0;&#x4F4D; &amp; &#x5783;&#x573E;&#x56DE;&#x6536;&#x6807;&#x8BB0;&#x4F4D;),(&#x6807;&#x8BB0;&#x4F4D; &amp; &#x5206;&#x914D;&#x4F4D;),&#x7B49;&#x6765;&#x6D4B;&#x8BD5;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x3002;&#x5176;&#x4E2D;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x6807;&#x8BB0;&#x4E3A;1&lt;&lt;0,&#x65E0;&#x6307;&#x9488;/&#x5757;&#x8FB9;&#x754C;&#x662F;1&lt;&lt;16,&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x6807;&#x8BB0;&#x4F4D;&#x4E3A;1&lt;&lt;32,&#x7279;&#x6B8A;&#x4F4D;1&lt;&lt;48</p><p>&#x5177;&#x4F53;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;: <img src="images/6.2.gc_bitmap.jpg?raw=true" alt=""></p><h2 id="&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;">&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;</h2><p>&#x50CF;C&#x8FD9;&#x79CD;&#x4E0D;&#x652F;&#x6301;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x5E93;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x8FD9;&#x7C7B;&#x5E93;&#x4E00;&#x822C;&#x4E5F;&#x662F;&#x7528;&#x7684;&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x4FDD;&#x5B88;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x201C;&#x4FDD;&#x5B88;&#x201D;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5462;&#xFF1F;&#x4E4B;&#x6240;&#x4EE5;&#x53EB;&#x201C;&#x4FDD;&#x5B88;&#x201D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x80FD;&#x4FDD;&#x5B88;&#x5730;&#x5047;&#x8BBE;&#x5730;&#x5740;&#x533A;&#x95F4;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B57;&#x90FD;&#x662F;&#x6307;&#x9488;&#x3002;</p><p>&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x4F1A;&#x9020;&#x6210;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x8FD9;&#x91CC;&#x4E3E;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;&#x3002;&#x5148;&#x770B;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x67D0;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x662F;&#x4E0D;&#x5305;&#x542B;&#x6307;&#x9488;&#x6210;&#x5458;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x8BE5;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x9012;&#x5F52;&#x5730;&#x6807;&#x8BB0;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6210;&#x5458;&#x7684;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x4E0D;&#x5305;&#x542B;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x5BF9;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x9012;&#x5F52;&#x5730;&#x6807;&#x8BB0;&#x4E0B;&#x53BB;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x4F1A;&#x6D6A;&#x8D39;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x8BF4;&#x660E;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x63D0;&#x9AD8;&#x6807;&#x8BB0;&#x8FC7;&#x7A0B;&#x7684;&#x901F;&#x5EA6;&#x3002;</p><p>&#x518D;&#x770B;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x5806;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;long&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x662F;8860225560&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x662F;long&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x4F1A;&#x628A;&#x4E2A;&#x5F53;&#x4F5C;&#x6307;&#x9488;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x5F15;&#x7528;&#x5230;&#x4E86;0x2101c5018&#x4F4D;&#x7F6E;&#x3002;&#x5047;&#x8BBE;0x2101c5018&#x78B0;&#x5DE7;&#x6709;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C31;&#x65E0;&#x6CD5;&#x88AB;&#x91CA;&#x653E;&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x7ECF;&#x6CA1;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x8BF4;&#x660E;&#xFF0C;&#x4FDD;&#x5B88;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x51FA;&#x73B0;&#x5783;&#x573E;&#x65E0;&#x6CD5;&#x88AB;&#x56DE;&#x6536;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x603B;&#x662F;&#x8BA9;&#x4EBA;&#x5F88;&#x4E0D;&#x723D;&#xFF0C;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x60F9;&#x7684;&#x7978;&#x3002;</p><p>&#x73B0;&#x5728;&#x597D;&#x4E86;&#xFF0C;Go&#x5728;1.1&#x7248;&#x672C;&#x4E2D;&#x5F00;&#x59CB;&#x652F;&#x6301;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x9996;&#x5148;&#x9700;&#x8981;&#x7684;&#x5C31;&#x662F;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x8BB2;&#x8FC7;MSpan&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x662F;&#x5B58;&#x50A8;&#x5728;MSpan&#x4E2D;&#x7684;&#x3002;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x8BA1;&#x7B97;&#x5B83;&#x6240;&#x5C5E;&#x7684;MSpan&#xFF0C;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p><pre><code>&#x9875;&#x53F7; = (&#x5730;&#x5740; - mheap.arena_start) &gt;&gt; &#x9875;&#x5927;&#x5C0F;
MSpan = mheap-&gt;map[&#x9875;&#x53F7;]
</code></pre><p>&#x63A5;&#x4E0B;&#x6765;&#x901A;&#x8FC7;MSpan-&gt;type&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5206;&#x914D;&#x5757;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;MType&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF1A;</p><pre><code class="lang-C">    <span class="hljs-keyword">struct</span> MTypes
    {
        byte    compression;    <span class="hljs-comment">// one of MTypes_*</span>
        <span class="hljs-keyword">bool</span>    sysalloc;    <span class="hljs-comment">// whether (void*)data is from runtime&#xB7;SysAlloc</span>
        uintptr    data;
    };
</code></pre><p>MTypes&#x63CF;&#x8FF0;MSpan&#x91CC;&#x5206;&#x914D;&#x7684;&#x5757;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x4E2D;compression&#x57DF;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x7684;&#x5E03;&#x5C40;&#x3002;&#x5B83;&#x7684;&#x53D6;&#x503C;&#x4E3A;MTypes_Empty&#xFF0C;MTypes_Single&#xFF0C;MTypes_Words&#xFF0C;MTypes_Bytes&#x56DB;&#x4E2A;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x3002;</p><pre><code>MTypes_Empty:
    &#x6240;&#x6709;&#x7684;&#x5757;&#x90FD;&#x662F;free&#x7684;&#xFF0C;&#x6216;&#x8005;&#x8FD9;&#x4E2A;&#x5206;&#x914D;&#x5757;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;data&#x57DF;&#x662F;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x3002;
MTypes_Single:
    &#x8FD9;&#x4E2A;MSpan&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;data&#x57DF;&#x5B58;&#x653E;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;sysalloc&#x57DF;&#x65E0;&#x610F;&#x4E49;
MTypes_Words:
    &#x8FD9;&#x4E2A;MSpan&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5757;(&#x5757;&#x7684;&#x79CD;&#x7C7B;&#x591A;&#x4E8E;7)&#x3002;&#x8FD9;&#x65F6;data&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;[NumBlocks]uintptr,&#xFF0C;&#x6570;&#x7EC4;&#x91CC;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5B58;&#x653E;&#x76F8;&#x5E94;&#x5757;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;
MTypes_Bytes:
    &#x8FD9;&#x4E2A;MSpan&#x4E2D;&#x5305;&#x542B;&#x6700;&#x591A;7&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5757;&#x3002;&#x8FD9;&#x65F6;data&#x57DF;&#x6307;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;
    struct {
        type  [8]uintptr       // type[0] is always 0
        index [NumBlocks]byte
    }
    &#x7B2C;i&#x4E2A;&#x5757;&#x7684;&#x7C7B;&#x578B;&#x662F;data.type[data.index[i]]
</code></pre><p>&#x8868;&#x9762;&#x4E0A;&#x770B;MTypes_Bytes&#x597D;&#x50CF;&#x6700;&#x590D;&#x6742;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x91CC;&#x7684;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x662F;MTypes_Empty&#x5C0F;&#x4E8E;MTypes_Single&#x5C0F;&#x4E8E;MTypes_Bytes&#x5C0F;&#x4E8E;MTypes_Words&#x7684;&#x3002;MTypes_Bytes&#x53EA;&#x4E0D;&#x8FC7;&#x4E3A;&#x4E86;&#x505A;&#x4F18;&#x5316;&#x800C;&#x663E;&#x5F97;&#x5F88;&#x590D;&#x6742;&#x3002;</p><p>&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x8BF4;&#x8FC7;&#xFF0C;&#x6BCF;&#x4E00;&#x5757;MSpan&#x4E2D;&#x5B58;&#x653E;&#x7684;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x4E00;&#x5B9A;&#x76F8;&#x540C;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;MSpan&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F;MTypes_Empty&#x3002;&#x5982;&#x679C;&#x5B58;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x5757;&#xFF0C;&#x5927;&#x4E8E;&#x8FD9;&#x4E2A;MSpan&#x5927;&#x5C0F;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x56E0;&#x6B64;&#x5B58;&#x4E0D;&#x4E86;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;MSpan&#x7684;&#x7C7B;&#x578B;&#x662F;MTypes_Single&#x3002;&#x5047;&#x8BBE;&#x5B58;&#x4E86;&#x591A;&#x79CD;&#x5757;&#xFF0C;&#x6BCF;&#x4E00;&#x5757;&#x7528;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;MTypes_Words&#x5B58;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x7C7B;&#x578B;&#x4E0D;&#x591A;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#x96C6;&#x4E2D;&#x8D77;&#x6765;&#x653E;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5B58;&#x50A8;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;</p><p>&#x5F97;&#x5230;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x6700;&#x7EC8;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF1A;</p><pre><code>struct Type
{
    uintptr size;
    uint32 hash;
    uint8 _unused;
    uint8 align;
    uint8 fieldAlign;
    uint8 kind;
    Alg *alg;
    void *gc;
    String *string;
    UncommonType *x;
    Type *ptrto;
};
</code></pre><p>&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x7ED3;&#x6784;&#x4F53;&#x7565;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x901A;&#x7528;&#x7684;&#x90E8;&#x5206;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;gc&#x57DF;&#xFF0C;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5C31;&#x662F;&#x5229;&#x7528;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x4E2D;&#x8FD9;&#x4E2A;gc&#x57DF;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p>&#x4ECE;gc&#x51FA;&#x53BB;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x6BB5;&#x6307;&#x4EE4;&#x7801;&#xFF0C;&#x662F;&#x5BF9;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x6307;&#x4EE4;&#xFF0C;Go&#x4E2D;&#x7528;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x673A;&#x6765;&#x6267;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6307;&#x4EE4;&#x7801;&#x3002;&#x5927;&#x81F4;&#x7684;&#x6846;&#x67B6;&#x662F;&#x7C7B;&#x4F3C;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x5B50;&#xFF1A;</p><pre><code class="lang-C">    <span class="hljs-keyword">for</span>(;;) {
        <span class="hljs-keyword">switch</span>(pc[<span class="hljs-number">0</span>]) {
            <span class="hljs-keyword">case</span> GC_PTR:
            <span class="hljs-keyword">break</span>;
            <span class="hljs-keyword">case</span> GC_SLICE:
            <span class="hljs-keyword">break</span>;
            <span class="hljs-keyword">case</span> GC_APTR:
            <span class="hljs-keyword">break</span>;
            <span class="hljs-keyword">case</span> GC_STRING:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_EFACE:
            <span class="hljs-keyword">if</span>(eface-&gt;type == nil)
                <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">break</span>;
            <span class="hljs-keyword">case</span> GC_IFACE:
            <span class="hljs-keyword">break</span>;
            <span class="hljs-keyword">case</span> GC_DEFAULT_PTR:
            <span class="hljs-keyword">while</span>(stack_top.b &lt;= end_b) {
                obj = *(byte**)stack_top.b;
                stack_top.b += PtrSize;
                <span class="hljs-keyword">if</span>(obj &gt;= arena_start &amp;&amp; obj &lt; arena_used) {
                    *ptrbufpos++ = (PtrTarget){obj, <span class="hljs-number">0</span>};
                    <span class="hljs-keyword">if</span>(ptrbufpos == ptrbuf_end)
                        flushptrbuf(ptrbuf, &amp;ptrbufpos, &amp;wp, &amp;wbuf, &amp;nobj);
                }
            }
            <span class="hljs-keyword">case</span> GC_ARRAY_START:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_ARRAY_NEXT:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_CALL:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_MAP_PTR:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_MAP_NEXT:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_REGION:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_CHAN_PTR:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">case</span> GC_CHAN:
            <span class="hljs-keyword">continue</span>;
            <span class="hljs-keyword">default</span>:
            runtime&#xB7;<span class="hljs-keyword">throw</span>(<span class="hljs-string">&quot;scanblock: invalid GC instruction&quot;</span>);
            <span class="hljs-keyword">return</span>;
        }
    }
</code></pre><h2 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h2><p>Go&#x8BED;&#x8A00;&#x4F7F;&#x7528;&#x6807;&#x8BB0;&#x6E05;&#x626B;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x6807;&#x8BB0;&#x4F4D;&#x56FE;&#x662F;&#x975E;&#x4FB5;&#x5165;&#x5F0F;&#x7684;&#xFF0C;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x8BBE;&#x8BA1;&#x5F97;&#x6BD4;&#x8F83;&#x5DE7;&#x5999;&#x3002;&#x5E76;&#x4E14;&#x5F53;&#x524D;&#x7248;&#x672C;&#x7684;Go&#x5B9E;&#x73B0;&#x4E86;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x5728;&#x7CBE;&#x786E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x5F97;&#x5230;&#x8BE5;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x6307;&#x4EE4;&#x7801;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x673A;&#x89E3;&#x91CA;&#x8FD9;&#x6BB5;&#x6307;&#x4EE4;&#x7801;&#x6765;&#x6267;&#x884C;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5DE5;&#x4F5C;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x5806;&#x4E2D;&#x4EFB;&#x610F;&#x5730;&#x5740;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x627E;&#x5230;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x8FC7;&#x7A0B;&#x4E3A;&#xFF0C;&#x5148;&#x901A;&#x8FC7;&#x5B83;&#x5728;&#x7684;&#x5185;&#x5B58;&#x9875;&#x627E;&#x5230;&#x5B83;&#x6240;&#x5C5E;&#x7684;MSpan&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;MSpan&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x627E;&#x5230;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x3002;</p><p>&#x4E0D;&#x77E5;&#x9053;&#x8BFB;&#x8005;&#x6709;&#x6CA1;&#x6709;&#x6CE8;&#x610F;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;MType&#x4E2D;&#x7684;data&#x503C;&#x5E94;&#x8BE5;&#x662F;&#x5B58;&#x653E;Type&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x4F46;&#x5B83;&#x5374;&#x662F;uintptr&#x8868;&#x793A;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p></section><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9312750344484857" data-ad-slot="2669241897" data-ad-format="auto" data-full-width-responsive="true"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div><a href="06.1.html" class="navigation navigation-prev" aria-label="上一页: 内存池"><i class="fa fa-angle-left"></i> </a><a href="06.3.html" class="navigation navigation-next" aria-label="下一页: 垃圾回收下篇"><i class="fa fa-angle-right"></i></a></div><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="輸入並搜尋"></div><nav role="navigation"><ul class="summary"><li class="chapter" data-level="1.1" data-path="./"><a href="./">简介</a></li><li class="chapter" data-level="1.2" data-path="01.0.html"><a href="01.0.html">如何研究Go内部实现</a><ul class="articles"><li class="chapter" data-level="1.2.1" data-path="01.1.html"><a href="01.1.html">从源代码安装Go</a></li><li class="chapter" data-level="1.2.2" data-path="01.2.html"><a href="01.2.html">本书的组织结构</a></li><li class="chapter" data-level="1.2.3" data-path="01.3.html"><a href="01.3.html">基本技巧</a></li></ul></li><li class="chapter" data-level="1.3" data-path="02.0.html"><a href="02.0.html">基本数据结构</a><ul class="articles"><li class="chapter" data-level="1.3.1" data-path="02.1.html"><a href="02.1.html">基本类型</a></li><li class="chapter" data-level="1.3.2" data-path="02.2.html"><a href="02.2.html">slice</a></li><li class="chapter" data-level="1.3.3" data-path="02.3.html"><a href="02.3.html">map的实现</a></li><li class="chapter" data-level="1.3.4" data-path="02.4.html"><a href="02.4.html">nil</a></li></ul></li><li class="chapter" data-level="1.4" data-path="03.0.html"><a href="03.0.html">函数调用协议</a><ul class="articles"><li class="chapter" data-level="1.4.1" data-path="03.1.html"><a href="03.1.html">Go调用汇编和C</a></li><li class="chapter" data-level="1.4.2" data-path="03.2.html"><a href="03.2.html">多值返回</a></li><li class="chapter" data-level="1.4.3" data-path="03.3.html"><a href="03.3.html">go关键字</a></li><li class="chapter" data-level="1.4.4" data-path="03.4.html"><a href="03.4.html">defer关键字</a></li><li class="chapter" data-level="1.4.5" data-path="03.5.html"><a href="03.5.html">连续栈</a></li><li class="chapter" data-level="1.4.6" data-path="03.6.html"><a href="03.6.html">闭包的实现</a></li></ul></li><li class="chapter" data-level="1.5" data-path="04.0.html"><a href="04.0.html">Go语言程序初始化过程</a><ul class="articles"><li class="chapter" data-level="1.5.1" data-path="04.1.html"><a href="04.1.html">系统初始化</a></li><li class="chapter" data-level="1.5.2" data-path="04.2.html"><a href="04.2.html">main.main之前的准备</a></li></ul></li><li class="chapter" data-level="1.6" data-path="05.0.html"><a href="05.0.html">goroutine调度</a><ul class="articles"><li class="chapter" data-level="1.6.1" data-path="05.1.html"><a href="05.1.html">调度器相关数据结构</a></li><li class="chapter" data-level="1.6.2" data-path="05.2.html"><a href="05.2.html">goroutine的生老病死</a></li><li class="chapter" data-level="1.6.3" data-path="05.3.html"><a href="05.3.html">设计与演化</a></li><li class="chapter" data-level="1.6.4"><span>[死锁检测和竞态检测]</span></li><li class="chapter" data-level="1.6.5" data-path="05.5.html"><a href="05.5.html">抢占式调度</a></li></ul></li><li class="chapter" data-level="1.7" data-path="06.0.html"><a href="06.0.html">内存管理</a><ul class="articles"><li class="chapter" data-level="1.7.1" data-path="06.1.html"><a href="06.1.html">内存池</a></li><li class="chapter active" data-level="1.7.2" data-path="06.2.html"><a href="06.2.html">垃圾回收上篇</a></li><li class="chapter" data-level="1.7.3" data-path="06.3.html"><a href="06.3.html">垃圾回收下篇</a></li></ul></li><li class="chapter" data-level="1.8" data-path="07.0.html"><a href="07.0.html">高级数据结构的实现</a><ul class="articles"><li class="chapter" data-level="1.8.1" data-path="07.1.html"><a href="07.1.html">channel</a></li><li class="chapter" data-level="1.8.2" data-path="07.2.html"><a href="07.2.html">interface</a></li><li class="chapter" data-level="1.8.3" data-path="07.3.html"><a href="07.3.html">方法调用</a></li></ul></li><li class="chapter" data-level="1.9" data-path="08.0.html"><a href="08.0.html">网络</a><ul class="articles"><li class="chapter" data-level="1.9.1" data-path="08.1.html"><a href="08.1.html">非阻塞io</a></li><li class="chapter" data-level="1.9.2"><span>[net包]</span></li></ul></li><li class="chapter" data-level="1.10" data-path="09.0.html"><a href="09.0.html">cgo</a><ul class="articles"><li class="chapter" data-level="1.10.1" data-path="09.1.html"><a href="09.1.html">预备知识</a></li><li class="chapter" data-level="1.10.2" data-path="09.2.html"><a href="09.2.html">cgo关键技术</a></li><li class="chapter" data-level="1.10.3" data-path="09.3.html"><a href="09.3.html">Go调用C</a></li><li class="chapter" data-level="1.10.4" data-path="09.4.html"><a href="09.4.html">C调用Go</a></li></ul></li><li class="chapter" data-level="1.11"><span>[杂项]</span><ul class="articles"><li class="chapter" data-level="1.11.1" data-path="10.1.html"><a href="10.1.html">内存模型</a></li><li class="chapter" data-level="1.11.2"><span>[pprof]</span></li><li class="chapter" data-level="1.11.3"><span>[底层同步机制]</span></li><li class="chapter" data-level="1.11.4" data-path="10.4.html"><a href="10.4.html">系统调用</a></li><li class="chapter" data-level="1.11.5"><span>[timer]</span></li><li class="chapter" data-level="1.11.6" data-path="10.7.html"><a href="10.7.html">运行时符号信息</a></li><li class="chapter" data-level="1.11.7"><span>[signal处理]</span></li></ul></li><li class="divider"></li><li><a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a></li></ul></nav></div><script>var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"垃圾回收上篇","level":"1.7.2","depth":2,"next":{"title":"垃圾回收下篇","level":"1.7.3","depth":2,"path":"06.3.md","ref":"06.3.md","articles":[]},"previous":{"title":"内存池","level":"1.7.1","depth":2,"path":"06.1.md","ref":"06.1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git","minifier"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"minifier":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深入理解Golang设计与实现","language":"zh","gitbook":"*"},"file":{"path":"06.2.md","mtime":"2020-10-18T13:41:23.985Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T13:41:59.918Z"},"basePath":".","book":{"language":"zh"}});
        });</script></div><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script><script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script><script src="../gitbook/gitbook-plugin-search/search-engine.js"></script><script src="../gitbook/gitbook-plugin-search/search.js"></script><script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script><script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script><script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script><script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script><script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script><script>window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();</script></body></html>